target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.sudo_nss_list = type { %struct.sudo_nss*, %struct.sudo_nss** }
%struct.sudo_nss = type { %struct.anon, i32 (%struct.sudo_nss*)*, i32 (%struct.sudo_nss*)*, %struct.sudoers_parse_tree* (%struct.sudo_nss*)*, i32 (%struct.sudo_nss*, %struct.passwd*)*, i32 (%struct.sudo_nss*)*, i8*, %struct.sudoers_parse_tree*, i8, i8 }
%struct.anon = type { %struct.sudo_nss*, %struct.sudo_nss** }
%struct.passwd = type { i8*, i8*, i32, i32, i8*, i8*, i8* }
%struct.sudoers_parse_tree = type { %struct.userspec_list, %struct.defaults_list, %struct.rbtree*, i8*, i8* }
%struct.userspec_list = type { %struct.userspec*, %struct.userspec** }
%struct.userspec = type { %struct.anon.0, %struct.member_list, %struct.privilege_list, %struct.comment_list, i32, i32, i8* }
%struct.anon.0 = type { %struct.userspec*, %struct.userspec** }
%struct.member_list = type { %struct.member*, %struct.member** }
%struct.member = type { %struct.anon.1, i8*, i16, i16 }
%struct.anon.1 = type { %struct.member*, %struct.member** }
%struct.privilege_list = type { %struct.privilege*, %struct.privilege** }
%struct.privilege = type { %struct.anon.2, i8*, %struct.member_list, %struct.cmndspec_list, %struct.defaults_list }
%struct.anon.2 = type { %struct.privilege*, %struct.privilege** }
%struct.cmndspec_list = type { %struct.cmndspec*, %struct.cmndspec** }

!25 = !DIEnumerator(name: "RLIMIT_CPU", value: 0, isUnsigned: true)
!26 = !DIEnumerator(name: "RLIMIT_FSIZE", value: 1, isUnsigned: true)
!27 = !DIEnumerator(name: "RLIMIT_DATA", value: 2, isUnsigned: true)
!28 = !DIEnumerator(name: "RLIMIT_STACK", value: 3, isUnsigned: true)
!29 = !DIEnumerator(name: "RLIMIT_CORE", value: 4, isUnsigned: true)
!30 = !DIEnumerator(name: "__RLIMIT_RSS", value: 5, isUnsigned: true)
!31 = !DIEnumerator(name: "RLIMIT_NOFILE", value: 7, isUnsigned: true)
!32 = !DIEnumerator(name: "__RLIMIT_OFILE", value: 7, isUnsigned: true)
!33 = !DIEnumerator(name: "RLIMIT_AS", value: 9, isUnsigned: true)
!34 = !DIEnumerator(name: "__RLIMIT_NPROC", value: 6, isUnsigned: true)
!35 = !DIEnumerator(name: "__RLIMIT_MEMLOCK", value: 8, isUnsigned: true)
!36 = !DIEnumerator(name: "__RLIMIT_LOCKS", value: 10, isUnsigned: true)
!37 = !DIEnumerator(name: "__RLIMIT_SIGPENDING", value: 11, isUnsigned: true)
!38 = !DIEnumerator(name: "__RLIMIT_MSGQUEUE", value: 12, isUnsigned: true)
!39 = !DIEnumerator(name: "__RLIMIT_NICE", value: 13, isUnsigned: true)
!40 = !DIEnumerator(name: "__RLIMIT_RTPRIO", value: 14, isUnsigned: true)
!41 = !DIEnumerator(name: "__RLIMIT_RTTIME", value: 15, isUnsigned: true)
!42 = !DIEnumerator(name: "__RLIMIT_NLIMITS", value: 16, isUnsigned: true)
!43 = !DIEnumerator(name: "__RLIM_NLIMITS", value: 16, isUnsigned: true)
!44 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "def_tuple", file: !45, line: 268, baseType: !17, size: 32, elements: !46)
!45 = !DIFile(filename: "./def_data.h", directory: "/media/joschua/Daten/Dateien/FAUbox/Uni/13._Semester/MA/Impl/vulns/sudo-1.9.5/plugins/sudoers")
!46 = !{!47, !48, !49, !50, !51, !52, !53, !54, !55, !56, !57, !58}
!47 = !DIEnumerator(name: "never", value: 0, isUnsigned: true)
!48 = !DIEnumerator(name: "once", value: 1, isUnsigned: true)
!49 = !DIEnumerator(name: "always", value: 2, isUnsigned: true)
!50 = !DIEnumerator(name: "any", value: 3, isUnsigned: true)
!51 = !DIEnumerator(name: "all", value: 4, isUnsigned: true)
!52 = !DIEnumerator(name: "digest_only", value: 5, isUnsigned: true)
!53 = !DIEnumerator(name: "global", value: 6, isUnsigned: true)
!54 = !DIEnumerator(name: "ppid", value: 7, isUnsigned: true)
!55 = !DIEnumerator(name: "tty", value: 8, isUnsigned: true)
!56 = !DIEnumerator(name: "kernel", value: 9, isUnsigned: true)
!57 = !DIEnumerator(name: "sudo", value: 10, isUnsigned: true)
!58 = !DIEnumerator(name: "json", value: 11, isUnsigned: true)
!59 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "eventlog_format", file: !60, line: 43, baseType: !17, size: 32, elements: !61)
!60 = !DIFile(filename: "../../include/sudo_eventlog.h", directory: "/media/joschua/Daten/Dateien/FAUbox/Uni/13._Semester/MA/Impl/vulns/sudo-1.9.5/plugins/sudoers")
!61 = !{!62, !63}
!62 = !DIEnumerator(name: "EVLOG_SUDO", value: 0, isUnsigned: true)
!63 = !DIEnumerator(name: "EVLOG_JSON", value: 1, isUnsigned: true)
!64 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !65, line: 46, baseType: !17, size: 32, elements: !66)
!65 = !DIFile(filename: "/usr/include/ctype.h", directory: "")
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74, !75, !76, !77, !78}
!67 = !DIEnumerator(name: "_ISupper", value: 256, isUnsigned: true)
!68 = !DIEnumerator(name: "_ISlower", value: 512, isUnsigned: true)
!69 = !DIEnumerator(name: "_ISalpha", value: 1024, isUnsigned: true)
!70 = !DIEnumerator(name: "_ISdigit", value: 2048, isUnsigned: true)
!71 = !DIEnumerator(name: "_ISxdigit", value: 4096, isUnsigned: true)
!72 = !DIEnumerator(name: "_ISspace", value: 8192, isUnsigned: true)
!73 = !DIEnumerator(name: "_ISprint", value: 16384, isUnsigned: true)
!74 = !DIEnumerator(name: "_ISgraph", value: 32768, isUnsigned: true)
!75 = !DIEnumerator(name: "_ISblank", value: 1, isUnsigned: true)
!76 = !DIEnumerator(name: "_IScntrl", value: 2, isUnsigned: true)
!77 = !DIEnumerator(name: "_ISpunct", value: 4, isUnsigned: true)
!78 = !DIEnumerator(name: "_ISalnum", value: 8, isUnsigned: true)
!79 = !{!7, !17, !80, !83, !6, !85, !86}
!80 = !DIDerivedType(tag: DW_TAG_typedef, name: "__rlim_t", file: !81, line: 145, baseType: !82)
!81 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!82 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !84, line: 46, baseType: !82)
!84 = !DIFile(filename: "/usr/lib/llvm-10/lib/clang/10.0.0/include/stddef.h", directory: "")
!85 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!86 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!87 = !{!0, !88, !205, !207, !209, !211, !214, !216, !218, !388, !390, !392, !394, !396, !403}
!88 = !DIGlobalVariableExpression(var: !89, expr: !DIExpression())
!89 = distinct !DIGlobalVariable(name: "sudo_user", scope: !12, file: !3, line: 84, type: !90, isLocal: false, isDefinition: true)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sudo_user", file: !16, line: 82, size: 2368, elements: !91)
!91 = !{!92, !101, !115, !116, !126, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !199, !201, !202}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "submit_time", scope: !90, file: !16, line: 83, baseType: !93, size: 128)
!93 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !94, line: 9, size: 128, elements: !95)
!94 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!95 = !{!96, !99}
!96 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !93, file: !94, line: 11, baseType: !97, size: 64)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !81, line: 148, baseType: !98)
!98 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !93, file: !94, line: 12, baseType: !100, size: 64, offset: 64)
!100 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !81, line: 184, baseType: !98)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "pw", scope: !90, file: !16, line: 84, baseType: !102, size: 64, offset: 128)
!102 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !103, size: 64)
!103 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", file: !104, line: 49, size: 384, elements: !105)
!104 = !DIFile(filename: "/usr/include/pwd.h", directory: "")
!105 = !{!106, !107, !108, !110, !112, !113, !114}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !103, file: !104, line: 51, baseType: !10, size: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !103, file: !104, line: 52, baseType: !10, size: 64, offset: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !103, file: !104, line: 53, baseType: !109, size: 32, offset: 128)
!109 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !81, line: 134, baseType: !17)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !103, file: !104, line: 54, baseType: !111, size: 32, offset: 160)
!111 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !81, line: 135, baseType: !17)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !103, file: !104, line: 55, baseType: !10, size: 64, offset: 192)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !103, file: !104, line: 56, baseType: !10, size: 64, offset: 256)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !103, file: !104, line: 57, baseType: !10, size: 64, offset: 320)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "_runas_pw", scope: !90, file: !16, line: 85, baseType: !102, size: 64, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "_runas_gr", scope: !90, file: !16, line: 86, baseType: !117, size: 64, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !118, size: 64)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "group", file: !119, line: 42, size: 256, elements: !120)
!119 = !DIFile(filename: "/usr/include/grp.h", directory: "")
!120 = !{!121, !122, !123, !124}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !118, file: !119, line: 44, baseType: !10, size: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !118, file: !119, line: 45, baseType: !10, size: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !118, file: !119, line: 46, baseType: !111, size: 32, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !118, file: !119, line: 47, baseType: !125, size: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "cmnd_stat", scope: !90, file: !16, line: 87, baseType: !127, size: 64, offset: 320)
!127 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !128, size: 64)
!128 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !129, line: 46, size: 1152, elements: !130)
!129 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/stat.h", directory: "")
!130 = !{!131, !133, !135, !137, !139, !140, !141, !142, !143, !145, !147, !149, !150, !151, !152}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !128, file: !129, line: 48, baseType: !132, size: 64)
!132 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !81, line: 133, baseType: !82)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !128, file: !129, line: 53, baseType: !134, size: 64, offset: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !81, line: 136, baseType: !82)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !128, file: !129, line: 61, baseType: !136, size: 64, offset: 128)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !81, line: 139, baseType: !82)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !128, file: !129, line: 62, baseType: !138, size: 32, offset: 192)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !81, line: 138, baseType: !17)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !128, file: !129, line: 64, baseType: !109, size: 32, offset: 224)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !128, file: !129, line: 65, baseType: !111, size: 32, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !128, file: !129, line: 67, baseType: !6, size: 32, offset: 288)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !128, file: !129, line: 69, baseType: !132, size: 64, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !128, file: !129, line: 74, baseType: !144, size: 64, offset: 384)
!144 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !81, line: 140, baseType: !98)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !128, file: !129, line: 78, baseType: !146, size: 64, offset: 448)
!146 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !81, line: 162, baseType: !98)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !128, file: !129, line: 80, baseType: !148, size: 64, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !81, line: 167, baseType: !98)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !128, file: !129, line: 91, baseType: !93, size: 128, offset: 576)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !128, file: !129, line: 92, baseType: !93, size: 128, offset: 704)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !128, file: !129, line: 93, baseType: !93, size: 128, offset: 832)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !128, file: !129, line: 106, baseType: !153, size: 192, offset: 960)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 192, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 3)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "cwd", scope: !90, file: !16, line: 88, baseType: !10, size: 64, offset: 384)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !90, file: !16, line: 89, baseType: !10, size: 64, offset: 448)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "runas_user", scope: !90, file: !16, line: 90, baseType: !10, size: 64, offset: 512)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "runas_group", scope: !90, file: !16, line: 91, baseType: !10, size: 64, offset: 576)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "path", scope: !90, file: !16, line: 92, baseType: !10, size: 64, offset: 640)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "tty", scope: !90, file: !16, line: 93, baseType: !10, size: 64, offset: 704)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ttypath", scope: !90, file: !16, line: 94, baseType: !10, size: 64, offset: 768)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "host", scope: !90, file: !16, line: 95, baseType: !10, size: 64, offset: 832)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "shost", scope: !90, file: !16, line: 96, baseType: !10, size: 64, offset: 896)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "runhost", scope: !90, file: !16, line: 97, baseType: !10, size: 64, offset: 960)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "srunhost", scope: !90, file: !16, line: 98, baseType: !10, size: 64, offset: 1024)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "runchroot", scope: !90, file: !16, line: 99, baseType: !10, size: 64, offset: 1088)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "runcwd", scope: !90, file: !16, line: 100, baseType: !10, size: 64, offset: 1152)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "prompt", scope: !90, file: !16, line: 101, baseType: !10, size: 64, offset: 1216)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "cmnd", scope: !90, file: !16, line: 102, baseType: !10, size: 64, offset: 1280)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "cmnd_args", scope: !90, file: !16, line: 103, baseType: !10, size: 64, offset: 1344)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "cmnd_base", scope: !90, file: !16, line: 104, baseType: !10, size: 64, offset: 1408)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "cmnd_safe", scope: !90, file: !16, line: 105, baseType: !10, size: 64, offset: 1472)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "class_name", scope: !90, file: !16, line: 106, baseType: !10, size: 64, offset: 1536)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "krb5_ccname", scope: !90, file: !16, line: 107, baseType: !10, size: 64, offset: 1600)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "gid_list", scope: !90, file: !16, line: 108, baseType: !177, size: 64, offset: 1664)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !178, size: 64)
!178 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "gid_list", file: !16, line: 65, size: 128, elements: !179)
!179 = !{!180, !181}
!180 = !DIDerivedType(tag: DW_TAG_member, name: "ngids", scope: !178, file: !16, line: 66, baseType: !6, size: 32)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "gids", scope: !178, file: !16, line: 67, baseType: !182, size: 64, offset: 64)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !183, size: 64)
!183 = !DIDerivedType(tag: DW_TAG_typedef, name: "gid_t", file: !184, line: 65, baseType: !111)
!184 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!185 = !DIDerivedType(tag: DW_TAG_member, name: "env_vars", scope: !90, file: !16, line: 109, baseType: !8, size: 64, offset: 1728)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "iolog_file", scope: !90, file: !16, line: 118, baseType: !10, size: 64, offset: 1792)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "iolog_path", scope: !90, file: !16, line: 119, baseType: !10, size: 64, offset: 1856)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "gids", scope: !90, file: !16, line: 120, baseType: !182, size: 64, offset: 1920)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "execfd", scope: !90, file: !16, line: 121, baseType: !6, size: 32, offset: 1984)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "ngids", scope: !90, file: !16, line: 122, baseType: !6, size: 32, offset: 2016)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "closefrom", scope: !90, file: !16, line: 123, baseType: !6, size: 32, offset: 2048)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "lines", scope: !90, file: !16, line: 124, baseType: !6, size: 32, offset: 2080)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "cols", scope: !90, file: !16, line: 125, baseType: !6, size: 32, offset: 2112)
!194 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !90, file: !16, line: 126, baseType: !6, size: 32, offset: 2144)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "max_groups", scope: !90, file: !16, line: 127, baseType: !6, size: 32, offset: 2176)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !90, file: !16, line: 128, baseType: !6, size: 32, offset: 2208)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "umask", scope: !90, file: !16, line: 129, baseType: !198, size: 32, offset: 2240)
!198 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !184, line: 70, baseType: !138)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "uid", scope: !90, file: !16, line: 130, baseType: !200, size: 32, offset: 2272)
!200 = !DIDerivedType(tag: DW_TAG_typedef, name: "uid_t", file: !184, line: 80, baseType: !109)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "gid", scope: !90, file: !16, line: 131, baseType: !200, size: 32, offset: 2304)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "sid", scope: !90, file: !16, line: 132, baseType: !203, size: 32, offset: 2336)
!203 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !184, line: 98, baseType: !204)
!204 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !81, line: 142, baseType: !6)
!205 = !DIGlobalVariableExpression(var: !206, expr: !DIExpression())
!206 = distinct !DIGlobalVariable(name: "list_pw", scope: !12, file: !3, line: 85, type: !102, isLocal: false, isDefinition: true)
!207 = !DIGlobalVariableExpression(var: !208, expr: !DIExpression())
!208 = distinct !DIGlobalVariable(name: "timestamp_uid", scope: !12, file: !3, line: 86, type: !200, isLocal: false, isDefinition: true)
!209 = !DIGlobalVariableExpression(var: !210, expr: !DIExpression())
!210 = distinct !DIGlobalVariable(name: "timestamp_gid", scope: !12, file: !3, line: 87, type: !183, isLocal: false, isDefinition: true)
!211 = !DIGlobalVariableExpression(var: !212, expr: !DIExpression())
!212 = distinct !DIGlobalVariable(name: "force_umask", scope: !12, file: !3, line: 91, type: !213, isLocal: false, isDefinition: true)
!213 = !DIBasicType(name: "_Bool", size: 8, encoding: DW_ATE_boolean)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "sudo_mode", scope: !12, file: !3, line: 92, type: !6, isLocal: false, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "prev_user", scope: !12, file: !3, line: 94, type: !10, isLocal: true, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "snl", scope: !12, file: !3, line: 95, type: !220, isLocal: true, isDefinition: true)
!220 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !221, size: 64)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sudo_nss_list", file: !222, line: 41, size: 128, elements: !223)
!222 = !DIFile(filename: "./sudo_nss.h", directory: "/media/joschua/Daten/Dateien/FAUbox/Uni/13._Semester/MA/Impl/vulns/sudo-1.9.5/plugins/sudoers")
!223 = !{!224, !387}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !221, file: !222, line: 41, baseType: !225, size: 64)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !226, size: 64)
!226 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sudo_nss", file: !222, line: 28, size: 640, elements: !227)
!227 = !{!228, !234, !238, !239, !378, !382, !383, !384, !385, !386}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !226, file: !222, line: 29, baseType: !229, size: 128)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !226, file: !222, line: 29, size: 128, elements: !230)
!230 = !{!231, !232}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !229, file: !222, line: 29, baseType: !225, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !229, file: !222, line: 29, baseType: !233, size: 64, offset: 64)
!233 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !225, size: 64)
!234 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !226, file: !222, line: 30, baseType: !235, size: 64, offset: 128)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !236, size: 64)
!236 = !DISubroutineType(types: !237)
!237 = !{!6, !225}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "close", scope: !226, file: !222, line: 31, baseType: !235, size: 64, offset: 192)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "parse", scope: !226, file: !222, line: 32, baseType: !240, size: 64, offset: 256)
!240 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !241, size: 64)
!241 = !DISubroutineType(types: !242)
!242 = !{!243, !225}
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !244, size: 64)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sudoers_parse_tree", file: !245, line: 281, size: 448, elements: !246)
!245 = !DIFile(filename: "./parse.h", directory: "/media/joschua/Daten/Dateien/FAUbox/Uni/13._Semester/MA/Impl/vulns/sudo-1.9.5/plugins/sudoers")
!246 = !{!247, !370, !371, !374, !377}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "userspecs", scope: !244, file: !245, line: 282, baseType: !248, size: 128)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "userspec_list", file: !245, line: 164, size: 128, elements: !249)
!249 = !{!250, !369}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !248, file: !245, line: 164, baseType: !251, size: 64)
!251 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !252, size: 64)
!252 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "userspec", file: !245, line: 174, size: 640, elements: !253)
!253 = !{!254, !260, !278, !352, !366, !367, !368}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !252, file: !245, line: 175, baseType: !255, size: 128)
!255 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !252, file: !245, line: 175, size: 128, elements: !256)
!256 = !{!257, !258}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !255, file: !245, line: 175, baseType: !251, size: 64)
!258 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !255, file: !245, line: 175, baseType: !259, size: 64, offset: 64)
!259 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !251, size: 64)
!260 = !DIDerivedType(tag: DW_TAG_member, name: "users", scope: !252, file: !245, line: 176, baseType: !261, size: 128, offset: 128)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "member_list", file: !245, line: 165, size: 128, elements: !262)
!262 = !{!263, !277}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !261, file: !245, line: 165, baseType: !264, size: 64)
!264 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !265, size: 64)
!265 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "member", file: !245, line: 231, size: 256, elements: !266)
!266 = !{!267, !273, !274, !276}
!267 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !265, file: !245, line: 232, baseType: !268, size: 128)
!268 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !265, file: !245, line: 232, size: 128, elements: !269)
!269 = !{!270, !271}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !268, file: !245, line: 232, baseType: !264, size: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !268, file: !245, line: 232, baseType: !272, size: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !264, size: 64)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !265, file: !245, line: 233, baseType: !10, size: 64, offset: 128)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !265, file: !245, line: 234, baseType: !275, size: 16, offset: 192)
!275 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!276 = !DIDerivedType(tag: DW_TAG_member, name: "negated", scope: !265, file: !245, line: 235, baseType: !275, size: 16, offset: 208)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !261, file: !245, line: 165, baseType: !272, size: 64, offset: 64)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "privileges", scope: !252, file: !245, line: 177, baseType: !279, size: 128, offset: 256)
!279 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "privilege_list", file: !245, line: 166, size: 128, elements: !280)
!280 = !{!281, !351}
!281 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !279, file: !245, line: 166, baseType: !282, size: 64)
!282 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !283, size: 64)
!283 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "privilege", file: !245, line: 187, size: 576, elements: !284)
!284 = !{!285, !291, !292, !293, !328}
!285 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !283, file: !245, line: 188, baseType: !286, size: 128)
!286 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !283, file: !245, line: 188, size: 128, elements: !287)
!287 = !{!288, !289}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !286, file: !245, line: 188, baseType: !282, size: 64)
!289 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !286, file: !245, line: 188, baseType: !290, size: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !282, size: 64)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "ldap_role", scope: !283, file: !245, line: 189, baseType: !10, size: 64, offset: 128)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "hostlist", scope: !283, file: !245, line: 190, baseType: !261, size: 128, offset: 192)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "cmndlist", scope: !283, file: !245, line: 191, baseType: !294, size: 128, offset: 320)
!294 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cmndspec_list", file: !245, line: 167, size: 128, elements: !295)
!295 = !{!296, !327}
!296 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !294, file: !245, line: 167, baseType: !297, size: 64)
!297 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !298, size: 64)
!298 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cmndspec", file: !245, line: 209, size: 640, elements: !299)
!299 = !{!300, !306, !308, !309, !310, !320, !321, !324, !325, !326}
!300 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !298, file: !245, line: 210, baseType: !301, size: 128)
!301 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !298, file: !245, line: 210, size: 128, elements: !302)
!302 = !{!303, !304}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !301, file: !245, line: 210, baseType: !297, size: 64)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !301, file: !245, line: 210, baseType: !305, size: 64, offset: 64)
!305 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !297, size: 64)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "runasuserlist", scope: !298, file: !245, line: 211, baseType: !307, size: 64, offset: 128)
!307 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !261, size: 64)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "runasgrouplist", scope: !298, file: !245, line: 212, baseType: !307, size: 64, offset: 192)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "cmnd", scope: !298, file: !245, line: 213, baseType: !264, size: 64, offset: 256)
!310 = !DIDerivedType(tag: DW_TAG_member, name: "tags", scope: !298, file: !245, line: 214, baseType: !311, size: 32, offset: 320)
!311 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "cmndtag", file: !245, line: 118, size: 32, elements: !312)
!312 = !{!313, !314, !315, !316, !317, !318, !319}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "nopasswd", scope: !311, file: !245, line: 119, baseType: !6, size: 3, flags: DIFlagBitField, extraData: i64 0)
!314 = !DIDerivedType(tag: DW_TAG_member, name: "noexec", scope: !311, file: !245, line: 120, baseType: !6, size: 3, offset: 3, flags: DIFlagBitField, extraData: i64 0)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "setenv", scope: !311, file: !245, line: 121, baseType: !6, size: 3, offset: 6, flags: DIFlagBitField, extraData: i64 0)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "log_input", scope: !311, file: !245, line: 122, baseType: !6, size: 3, offset: 9, flags: DIFlagBitField, extraData: i64 0)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "log_output", scope: !311, file: !245, line: 123, baseType: !6, size: 3, offset: 12, flags: DIFlagBitField, extraData: i64 0)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "send_mail", scope: !311, file: !245, line: 124, baseType: !6, size: 3, offset: 15, flags: DIFlagBitField, extraData: i64 0)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "follow", scope: !311, file: !245, line: 125, baseType: !6, size: 3, offset: 18, flags: DIFlagBitField, extraData: i64 0)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "timeout", scope: !298, file: !245, line: 215, baseType: !6, size: 32, offset: 352)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "notbefore", scope: !298, file: !245, line: 216, baseType: !322, size: 64, offset: 384)
!322 = !DIDerivedType(tag: DW_TAG_typedef, name: "time_t", file: !323, line: 7, baseType: !97)
!323 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/time_t.h", directory: "")
!324 = !DIDerivedType(tag: DW_TAG_member, name: "notafter", scope: !298, file: !245, line: 217, baseType: !322, size: 64, offset: 448)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "runcwd", scope: !298, file: !245, line: 218, baseType: !10, size: 64, offset: 512)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "runchroot", scope: !298, file: !245, line: 219, baseType: !10, size: 64, offset: 576)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !294, file: !245, line: 167, baseType: !305, size: 64, offset: 64)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !283, file: !245, line: 192, baseType: !329, size: 128, offset: 448)
!329 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "defaults_list", file: !245, line: 163, size: 128, elements: !330)
!330 = !{!331, !350}
!331 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_first", scope: !329, file: !245, line: 163, baseType: !332, size: 64)
!332 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !333, size: 64)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "defaults", file: !245, line: 265, size: 512, elements: !334)
!334 = !{!335, !341, !342, !343, !344, !345, !346, !347, !348, !349}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !333, file: !245, line: 266, baseType: !336, size: 128)
!336 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !333, file: !245, line: 266, size: 128, elements: !337)
!337 = !{!338, !339}
!338 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_next", scope: !336, file: !245, line: 266, baseType: !332, size: 64)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "tqe_prev", scope: !336, file: !245, line: 266, baseType: !340, size: 64, offset: 64)
!340 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !332, size: 64)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "var", scope: !333, file: !245, line: 267, baseType: !10, size: 64, offset: 128)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "val", scope: !333, file: !245, line: 268, baseType: !10, size: 64, offset: 192)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "binding", scope: !333, file: !245, line: 269, baseType: !307, size: 64, offset: 256)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !333, file: !245, line: 270, baseType: !10, size: 64, offset: 320)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "type", scope: !333, file: !245, line: 271, baseType: !275, size: 16, offset: 384)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "op", scope: !333, file: !245, line: 272, baseType: !11, size: 8, offset: 400)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !333, file: !245, line: 273, baseType: !11, size: 8, offset: 408)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !333, file: !245, line: 274, baseType: !6, size: 32, offset: 416)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !333, file: !245, line: 275, baseType: !6, size: 32, offset: 448)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !329, file: !245, line: 163, baseType: !340, size: 64, offset: 64)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !279, file: !245, line: 166, baseType: !290, size: 64, offset: 64)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "comments", scope: !252, file: !245, line: 178, baseType: !353, size: 128, offset: 384)
!353 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "comment_list", file: !245, line: 169, size: 128, elements: !354)
!354 = !{!355, !364}
!355 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_first", scope: !353, file: !245, line: 169, baseType: !356, size: 64)
!356 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !357, size: 64)
!357 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "sudoers_comment", file: !245, line: 243, size: 128, elements: !358)
!358 = !{!359, !363}
!359 = !DIDerivedType(tag: DW_TAG_member, name: "entries", scope: !357, file: !245, line: 244, baseType: !360, size: 64)
!360 = distinct !DICompositeType(tag: DW_TAG_structure_type, scope: !357, file: !245, line: 244, size: 64, elements: !361)
!361 = !{!362}
!362 = !DIDerivedType(tag: DW_TAG_member, name: "stqe_next", scope: !360, file: !245, line: 244, baseType: !356, size: 64)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "str", scope: !357, file: !245, line: 245, baseType: !10, size: 64, offset: 64)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "stqh_last", scope: !353, file: !245, line: 169, baseType: !365, size: 64, offset: 64)
!365 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !252, file: !245, line: 179, baseType: !6, size: 32, offset: 512)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !252, file: !245, line: 180, baseType: !6, size: 32, offset: 544)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !252, file: !245, line: 181, baseType: !10, size: 64, offset: 576)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !248, file: !245, line: 164, baseType: !259, size: 64, offset: 64)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "defaults", scope: !244, file: !245, line: 283, baseType: !329, size: 128, offset: 128)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "aliases", scope: !244, file: !245, line: 284, baseType: !372, size: 64, offset: 256)
!372 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !373, size: 64)
!373 = !DICompositeType(tag: DW_TAG_structure_type, name: "rbtree", file: !245, line: 284, flags: DIFlagFwdDecl)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "shost", scope: !244, file: !245, line: 285, baseType: !375, size: 64, offset: 320)
!375 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!376 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !11)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "lhost", scope: !244, file: !245, line: 285, baseType: !375, size: 64, offset: 384)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "query", scope: !226, file: !222, line: 33, baseType: !379, size: 64, offset: 320)
!379 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !380, size: 64)
!380 = !DISubroutineType(types: !381)
!381 = !{!6, !225, !102}
!382 = !DIDerivedType(tag: DW_TAG_member, name: "getdefs", scope: !226, file: !222, line: 34, baseType: !235, size: 64, offset: 384)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "handle", scope: !226, file: !222, line: 35, baseType: !7, size: 64, offset: 448)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "parse_tree", scope: !226, file: !222, line: 36, baseType: !243, size: 64, offset: 512)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "ret_if_found", scope: !226, file: !222, line: 37, baseType: !213, size: 8, offset: 576)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "ret_if_notfound", scope: !226, file: !222, line: 38, baseType: !213, size: 8, offset: 584)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "tqh_last", scope: !221, file: !222, line: 41, baseType: !233, size: 64, offset: 64)
!388 = !DIGlobalVariableExpression(var: !389, expr: !DIExpression())
!389 = distinct !DIGlobalVariable(name: "unknown_runas_uid", scope: !12, file: !3, line: 96, type: !213, isLocal: true, isDefinition: true)
!390 = !DIGlobalVariableExpression(var: !391, expr: !DIExpression())
!391 = distinct !DIGlobalVariable(name: "unknown_runas_gid", scope: !12, file: !3, line: 97, type: !213, isLocal: true, isDefinition: true)
!392 = !DIGlobalVariableExpression(var: !393, expr: !DIExpression())
!393 = distinct !DIGlobalVariable(name: "NewArgc", scope: !12, file: !3, line: 105, type: !6, isLocal: false, isDefinition: true)
!394 = !DIGlobalVariableExpression(var: !395, expr: !DIExpression())
!395 = distinct !DIGlobalVariable(name: "NewArgv", scope: !12, file: !3, line: 106, type: !125, isLocal: false, isDefinition: true)
!396 = !DIGlobalVariableExpression(var: !397, expr: !DIExpression())
!397 = distinct !DIGlobalVariable(name: "nproclimit", scope: !12, file: !3, line: 101, type: !398, isLocal: true, isDefinition: true)
!398 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "rlimit", file: !23, line: 139, size: 128, elements: !399)
!399 = !{!400, !402}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_cur", scope: !398, file: !23, line: 142, baseType: !401, size: 64)
!401 = !DIDerivedType(tag: DW_TAG_typedef, name: "rlim_t", file: !23, line: 131, baseType: !80)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_max", scope: !398, file: !23, line: 144, baseType: !401, size: 64, offset: 64)
!403 = !DIGlobalVariableExpression(var: !404, expr: !DIExpression())
!404 = distinct !DIGlobalVariable(name: "cmnd_status", scope: !12, file: !3, line: 98, type: !6, isLocal: true, isDefinition: true)
!405 = !{}
!406 = !{i32 7, !"Dwarf Version", i32 4}
!407 = !{i32 2, !"Debug Info Version", i32 3}
!408 = !{i32 1, !"wchar_size", i32 4}
!409 = !{i32 7, !"PIC Level", i32 2}
!410 = !{i32 7, !"PIE Level", i32 2}
!411 = !{!"clang version 10.0.0-4ubuntu1~18.04.2 "}
!412 = !DILocalVariable(name: "info", arg: 1, scope: !2, file: !3, line: 155, type: !7)
!413 = !DILocation(line: 155, column: 20, scope: !2)
!414 = !DILocalVariable(name: "envp", arg: 2, scope: !2, file: !3, line: 155, type: !8)
!415 = !DILocation(line: 155, column: 39, scope: !2)
!416 = !DILocalVariable(name: "nss", scope: !2, file: !3, line: 157, type: !225)
!417 = !DILocation(line: 157, column: 22, scope: !2)
!418 = !DILocalVariable(name: "nss_next", scope: !2, file: !3, line: 157, type: !225)
!419 = !DILocation(line: 157, column: 28, scope: !2)
!420 = !DILocalVariable(name: "oldlocale", scope: !2, file: !3, line: 158, type: !6)
!421 = !DILocation(line: 158, column: 9, scope: !2)
!422 = !DILocalVariable(name: "sources", scope: !2, file: !3, line: 158, type: !6)
!423 = !DILocation(line: 158, column: 20, scope: !2)
!424 = !DILocalVariable(name: "sudo_debug_subsys", scope: !2, file: !3, line: 160, type: !425)
!425 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !6)
!426 = !DILocation(line: 160, column: 5, scope: !2)
!427 = !DILocation(line: 162, column: 9, scope: !428)
!428 = distinct !DILexicalBlock(scope: !2, file: !3, line: 162, column: 9)
!429 = !DILocation(line: 162, column: 13, scope: !428)
!430 = !DILocation(line: 162, column: 9, scope: !2)
!431 = !DILocation(line: 163, column: 2, scope: !428)
!432 = !DILocalVariable(name: "sudo_debug_ret", scope: !433, file: !3, line: 163, type: !6)
!433 = distinct !DILexicalBlock(scope: !428, file: !3, line: 163, column: 2)
!434 = !DILocation(line: 163, column: 2, scope: !433)
!435 = !DILocation(line: 165, column: 5, scope: !2)
!436 = !DILocation(line: 168, column: 5, scope: !2)
!437 = !DILocation(line: 171, column: 19, scope: !438)
!438 = distinct !DILexicalBlock(scope: !2, file: !3, line: 171, column: 9)
!439 = !DILocation(line: 171, column: 10, scope: !438)
!440 = !DILocation(line: 171, column: 9, scope: !2)
!441 = !DILocation(line: 172, column: 2, scope: !438)
!442 = !DILocalVariable(name: "sudo_debug_ret", scope: !443, file: !3, line: 172, type: !6)
!443 = distinct !DILexicalBlock(scope: !438, file: !3, line: 172, column: 2)
!444 = !DILocation(line: 172, column: 2, scope: !443)
!445 = !DILocation(line: 175, column: 10, scope: !446)
!446 = distinct !DILexicalBlock(scope: !2, file: !3, line: 175, column: 9)
!447 = !DILocation(line: 175, column: 9, scope: !2)
!448 = !DILocation(line: 176, column: 2, scope: !449)
!449 = distinct !DILexicalBlock(scope: !446, file: !3, line: 175, column: 27)
!450 = !DILocation(line: 176, column: 2, scope: !451)
!451 = distinct !DILexicalBlock(scope: !449, file: !3, line: 176, column: 2)
!452 = !DILocation(line: 177, column: 2, scope: !449)
!453 = !DILocalVariable(name: "sudo_debug_ret", scope: !454, file: !3, line: 177, type: !6)
!454 = distinct !DILexicalBlock(scope: !449, file: !3, line: 177, column: 2)
!455 = !DILocation(line: 177, column: 2, scope: !454)
!456 = !DILocation(line: 178, column: 5, scope: !449)
!457 = !DILocation(line: 181, column: 49, scope: !2)
!458 = !DILocation(line: 181, column: 17, scope: !2)
!459 = !DILocation(line: 181, column: 15, scope: !2)
!460 = !DILocation(line: 182, column: 9, scope: !461)
!461 = distinct !DILexicalBlock(scope: !2, file: !3, line: 182, column: 9)
!462 = !DILocation(line: 182, column: 9, scope: !2)
!463 = !DILocation(line: 183, column: 2, scope: !461)
!464 = !DILocalVariable(name: "sudo_debug_ret", scope: !465, file: !3, line: 183, type: !6)
!465 = distinct !DILexicalBlock(scope: !461, file: !3, line: 183, column: 2)
!466 = !DILocation(line: 183, column: 2, scope: !465)
!467 = !DILocation(line: 185, column: 20, scope: !468)
!468 = distinct !DILexicalBlock(scope: !2, file: !3, line: 185, column: 9)
!469 = !DILocation(line: 185, column: 10, scope: !468)
!470 = !DILocation(line: 185, column: 9, scope: !2)
!471 = !DILocation(line: 186, column: 2, scope: !468)
!472 = !DILocalVariable(name: "sudo_debug_ret", scope: !473, file: !3, line: 186, type: !6)
!473 = distinct !DILexicalBlock(scope: !468, file: !3, line: 186, column: 2)
!474 = !DILocation(line: 186, column: 2, scope: !473)
!475 = !DILocation(line: 189, column: 11, scope: !2)
!476 = !DILocation(line: 189, column: 9, scope: !2)
!477 = !DILocation(line: 192, column: 10, scope: !478)
!478 = distinct !DILexicalBlock(scope: !2, file: !3, line: 192, column: 9)
!479 = !DILocation(line: 192, column: 9, scope: !2)
!480 = !DILocation(line: 193, column: 2, scope: !478)
!481 = !DILocalVariable(name: "sudo_debug_ret", scope: !482, file: !3, line: 193, type: !6)
!482 = distinct !DILexicalBlock(scope: !478, file: !3, line: 193, column: 2)
!483 = !DILocation(line: 193, column: 2, scope: !482)
!484 = !DILocation(line: 199, column: 5, scope: !2)
!485 = !DILocation(line: 200, column: 5, scope: !2)
!486 = !DILocation(line: 201, column: 17, scope: !2)
!487 = !DILocation(line: 201, column: 5, scope: !2)
!488 = !DILocation(line: 202, column: 5, scope: !489)
!489 = distinct !DILexicalBlock(scope: !2, file: !3, line: 202, column: 5)
!490 = !DILocation(line: 202, column: 5, scope: !491)
!491 = distinct !DILexicalBlock(scope: !489, file: !3, line: 202, column: 5)
!492 = !DILocation(line: 0, scope: !491)
!493 = !DILocation(line: 203, column: 6, scope: !494)
!494 = distinct !DILexicalBlock(scope: !495, file: !3, line: 203, column: 6)
!495 = distinct !DILexicalBlock(scope: !491, file: !3, line: 202, column: 53)
!496 = !DILocation(line: 203, column: 11, scope: !494)
!497 = !DILocation(line: 203, column: 16, scope: !494)
!498 = !DILocation(line: 203, column: 21, scope: !494)
!499 = !DILocation(line: 203, column: 27, scope: !494)
!500 = !DILocation(line: 203, column: 49, scope: !494)
!501 = !DILocation(line: 203, column: 54, scope: !494)
!502 = !DILocation(line: 203, column: 60, scope: !494)
!503 = !DILocation(line: 203, column: 31, scope: !494)
!504 = !DILocation(line: 203, column: 36, scope: !494)
!505 = !DILocation(line: 203, column: 47, scope: !494)
!506 = !DILocation(line: 203, column: 66, scope: !494)
!507 = !DILocation(line: 203, column: 6, scope: !495)
!508 = !DILocation(line: 204, column: 6, scope: !509)
!509 = distinct !DILexicalBlock(scope: !494, file: !3, line: 203, column: 75)
!510 = !DILocation(line: 204, column: 6, scope: !511)
!511 = distinct !DILexicalBlock(scope: !509, file: !3, line: 204, column: 6)
!512 = !DILocation(line: 204, column: 6, scope: !513)
!513 = distinct !DILexicalBlock(scope: !511, file: !3, line: 204, column: 6)
!514 = !DILocation(line: 204, column: 6, scope: !515)
!515 = distinct !DILexicalBlock(scope: !511, file: !3, line: 204, column: 6)
!516 = !DILocation(line: 204, column: 6, scope: !517)
!517 = distinct !DILexicalBlock(scope: !515, file: !3, line: 204, column: 6)
!518 = !DILocation(line: 205, column: 6, scope: !509)
!519 = !DILocation(line: 208, column: 9, scope: !495)
!520 = !DILocation(line: 209, column: 6, scope: !521)
!521 = distinct !DILexicalBlock(scope: !495, file: !3, line: 209, column: 6)
!522 = !DILocation(line: 209, column: 11, scope: !521)
!523 = !DILocation(line: 209, column: 19, scope: !521)
!524 = !DILocation(line: 209, column: 24, scope: !521)
!525 = !DILocation(line: 209, column: 30, scope: !521)
!526 = !DILocation(line: 209, column: 50, scope: !521)
!527 = !DILocation(line: 209, column: 55, scope: !521)
!528 = !DILocation(line: 209, column: 34, scope: !521)
!529 = !DILocation(line: 209, column: 6, scope: !495)
!530 = !DILocation(line: 211, column: 6, scope: !531)
!531 = distinct !DILexicalBlock(scope: !521, file: !3, line: 210, column: 67)
!532 = !DILocation(line: 213, column: 2, scope: !531)
!533 = !DILocation(line: 214, column: 5, scope: !495)
!534 = distinct !{!534, !488, !535}
!535 = !DILocation(line: 214, column: 5, scope: !489)
!536 = !DILocation(line: 215, column: 9, scope: !537)
!537 = distinct !DILexicalBlock(scope: !2, file: !3, line: 215, column: 9)
!538 = !DILocation(line: 215, column: 17, scope: !537)
!539 = !DILocation(line: 215, column: 9, scope: !2)
!540 = !DILocation(line: 216, column: 2, scope: !541)
!541 = distinct !DILexicalBlock(scope: !537, file: !3, line: 215, column: 23)
!542 = !DILocation(line: 216, column: 2, scope: !543)
!543 = distinct !DILexicalBlock(scope: !541, file: !3, line: 216, column: 2)
!544 = !DILocation(line: 217, column: 2, scope: !541)
!545 = !DILocation(line: 221, column: 24, scope: !546)
!546 = distinct !DILexicalBlock(scope: !2, file: !3, line: 221, column: 9)
!547 = !DILocation(line: 221, column: 35, scope: !546)
!548 = !DILocation(line: 221, column: 56, scope: !546)
!549 = !DILocation(line: 221, column: 9, scope: !546)
!550 = !DILocation(line: 221, column: 9, scope: !2)
!551 = !DILocation(line: 222, column: 6, scope: !546)
!552 = !DILocation(line: 222, column: 2, scope: !546)
!553 = !DILocation(line: 221, column: 58, scope: !546)
!554 = !DILabel(scope: !2, name: "cleanup", file: !3, line: 224)
!555 = !DILocation(line: 224, column: 1, scope: !2)
!556 = !DILocation(line: 225, column: 10, scope: !557)
!557 = distinct !DILexicalBlock(scope: !2, file: !3, line: 225, column: 9)
!558 = !DILocation(line: 225, column: 9, scope: !2)
!559 = !DILocation(line: 226, column: 6, scope: !557)
!560 = !DILocation(line: 226, column: 2, scope: !557)
!561 = !DILocation(line: 229, column: 5, scope: !2)
!562 = !DILocation(line: 230, column: 23, scope: !2)
!563 = !DILocation(line: 230, column: 5, scope: !2)
!564 = !DILocation(line: 232, column: 5, scope: !2)
!565 = !DILocalVariable(name: "sudo_debug_ret", scope: !566, file: !3, line: 232, type: !6)
!566 = distinct !DILexicalBlock(scope: !2, file: !3, line: 232, column: 5)
!567 = !DILocation(line: 232, column: 5, scope: !566)
!568 = !DILocation(line: 233, column: 1, scope: !2)
!569 = distinct !DISubprogram(name: "sudoers_cleanup", scope: !3, file: !3, line: 1629, type: !570, scopeLine: 1630, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !12, retainedNodes: !405)
!570 = !DISubroutineType(types: !571)
!571 = !{null}
!572 = !DILocalVariable(name: "nss", scope: !569, file: !3, line: 1631, type: !225)
!573 = !DILocation(line: 1631, column: 22, scope: !569)
!574 = !DILocalVariable(name: "sudo_debug_subsys", scope: !569, file: !3, line: 1632, type: !425)
!575 = !DILocation(line: 1632, column: 5, scope: !569)
!576 = !DILocation(line: 1634, column: 9, scope: !577)
!577 = distinct !DILexicalBlock(scope: !569, file: !3, line: 1634, column: 9)
!578 = !DILocation(line: 1634, column: 13, scope: !577)
!579 = !DILocation(line: 1634, column: 9, scope: !569)
!580 = !DILocation(line: 1635, column: 2, scope: !581)
!581 = distinct !DILexicalBlock(scope: !582, file: !3, line: 1635, column: 2)
!582 = distinct !DILexicalBlock(scope: !577, file: !3, line: 1634, column: 22)
!583 = !DILocation(line: 1635, column: 2, scope: !584)
!584 = distinct !DILexicalBlock(scope: !581, file: !3, line: 1635, column: 2)
!585 = !DILocation(line: 1636, column: 6, scope: !586)
!586 = distinct !DILexicalBlock(scope: !584, file: !3, line: 1635, column: 35)
!587 = !DILocation(line: 1636, column: 11, scope: !586)
!588 = !DILocation(line: 1636, column: 17, scope: !586)
!589 = !DILocation(line: 1637, column: 2, scope: !586)
!590 = distinct !{!590, !580, !591}
!591 = !DILocation(line: 1637, column: 2, scope: !581)
!592 = !DILocation(line: 1638, column: 5, scope: !582)
!593 = !DILocation(line: 1639, column: 9, scope: !594)
!594 = distinct !DILexicalBlock(scope: !569, file: !3, line: 1639, column: 9)
!595 = !DILocation(line: 1639, column: 9, scope: !569)
!596 = !DILocation(line: 1640, column: 2, scope: !594)
!597 = !DILocation(line: 1641, column: 5, scope: !569)
!598 = !DILocation(line: 1642, column: 5, scope: !569)
!599 = !DILocation(line: 1644, column: 5, scope: !569)
!600 = !DILocation(line: 1644, column: 5, scope: !601)
!601 = distinct !DILexicalBlock(scope: !569, file: !3, line: 1644, column: 5)
!602 = !DILocation(line: 1645, column: 1, scope: !569)
!603 = distinct !DISubprogram(name: "init_vars", scope: !3, file: !3, line: 785, type: !604, scopeLine: 786, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, retainedNodes: !405)
!604 = !DISubroutineType(types: !605)
!605 = !{!213, !8}
!606 = !DILocalVariable(name: "envp", arg: 1, scope: !603, file: !3, line: 785, type: !8)
!607 = !DILocation(line: 785, column: 24, scope: !603)
!608 = !DILocalVariable(name: "ep", scope: !603, file: !3, line: 787, type: !8)
!609 = !DILocation(line: 787, column: 20, scope: !603)
!610 = !DILocalVariable(name: "unknown_user", scope: !603, file: !3, line: 788, type: !213)
!611 = !DILocation(line: 788, column: 10, scope: !603)
!612 = !DILocalVariable(name: "sudo_debug_subsys", scope: !603, file: !3, line: 789, type: !425)
!613 = !DILocation(line: 789, column: 5, scope: !603)
!614 = !DILocation(line: 791, column: 29, scope: !615)
!615 = distinct !DILexicalBlock(scope: !603, file: !3, line: 791, column: 9)
!616 = !DILocation(line: 791, column: 54, scope: !615)
!617 = !DILocation(line: 791, column: 10, scope: !615)
!618 = !DILocation(line: 791, column: 9, scope: !603)
!619 = !DILocation(line: 792, column: 2, scope: !620)
!620 = distinct !DILexicalBlock(scope: !615, file: !3, line: 791, column: 75)
!621 = !DILocation(line: 792, column: 2, scope: !622)
!622 = distinct !DILexicalBlock(scope: !620, file: !3, line: 792, column: 2)
!623 = !DILocation(line: 793, column: 2, scope: !620)
!624 = !DILocalVariable(name: "sudo_debug_ret", scope: !625, file: !3, line: 793, type: !213)
!625 = distinct !DILexicalBlock(scope: !620, file: !3, line: 793, column: 2)
!626 = !DILocation(line: 793, column: 2, scope: !625)
!627 = !DILocation(line: 794, column: 5, scope: !620)
!628 = !DILocation(line: 799, column: 15, scope: !629)
!629 = distinct !DILexicalBlock(scope: !603, file: !3, line: 799, column: 5)
!630 = !DILocation(line: 799, column: 13, scope: !629)
!631 = !DILocation(line: 799, column: 10, scope: !629)
!632 = !DILocation(line: 799, column: 22, scope: !633)
!633 = distinct !DILexicalBlock(scope: !629, file: !3, line: 799, column: 5)
!634 = !DILocation(line: 799, column: 21, scope: !633)
!635 = !DILocation(line: 799, column: 5, scope: !629)
!636 = !DILocation(line: 800, column: 12, scope: !637)
!637 = distinct !DILexicalBlock(scope: !633, file: !3, line: 799, column: 32)
!638 = !DILocation(line: 800, column: 11, scope: !637)
!639 = !DILocation(line: 800, column: 10, scope: !637)
!640 = !DILocation(line: 800, column: 2, scope: !637)
!641 = !DILocation(line: 802, column: 7, scope: !642)
!642 = distinct !DILexicalBlock(scope: !643, file: !3, line: 802, column: 7)
!643 = distinct !DILexicalBlock(scope: !637, file: !3, line: 800, column: 16)
!644 = !DILocation(line: 802, column: 7, scope: !643)
!645 = !DILocation(line: 803, column: 22, scope: !642)
!646 = !DILocation(line: 803, column: 21, scope: !642)
!647 = !DILocation(line: 803, column: 25, scope: !642)
!648 = !DILocation(line: 803, column: 49, scope: !642)
!649 = !DILocation(line: 803, column: 19, scope: !642)
!650 = !DILocation(line: 803, column: 7, scope: !642)
!651 = !DILocation(line: 804, column: 3, scope: !643)
!652 = !DILocation(line: 806, column: 7, scope: !653)
!653 = distinct !DILexicalBlock(scope: !643, file: !3, line: 806, column: 7)
!654 = !DILocation(line: 806, column: 7, scope: !643)
!655 = !DILocation(line: 807, column: 20, scope: !653)
!656 = !DILocation(line: 807, column: 19, scope: !653)
!657 = !DILocation(line: 807, column: 23, scope: !653)
!658 = !DILocation(line: 807, column: 41, scope: !653)
!659 = !DILocation(line: 807, column: 17, scope: !653)
!660 = !DILocation(line: 807, column: 7, scope: !653)
!661 = !DILocation(line: 808, column: 3, scope: !643)
!662 = !DILocation(line: 810, column: 7, scope: !663)
!663 = distinct !DILexicalBlock(scope: !643, file: !3, line: 810, column: 7)
!664 = !DILocation(line: 810, column: 7, scope: !643)
!665 = !DILocation(line: 812, column: 11, scope: !666)
!666 = distinct !DILexicalBlock(scope: !667, file: !3, line: 812, column: 11)
!667 = distinct !DILexicalBlock(scope: !663, file: !3, line: 810, column: 37)
!668 = !DILocation(line: 812, column: 23, scope: !666)
!669 = !DILocation(line: 812, column: 11, scope: !667)
!670 = !DILocation(line: 813, column: 19, scope: !666)
!671 = !DILocation(line: 813, column: 18, scope: !666)
!672 = !DILocation(line: 813, column: 22, scope: !666)
!673 = !DILocation(line: 813, column: 47, scope: !666)
!674 = !DILocation(line: 813, column: 16, scope: !666)
!675 = !DILocation(line: 813, column: 4, scope: !666)
!676 = !DILocation(line: 814, column: 7, scope: !667)
!677 = !DILocation(line: 816, column: 7, scope: !678)
!678 = distinct !DILexicalBlock(scope: !643, file: !3, line: 816, column: 7)
!679 = !DILocation(line: 816, column: 7, scope: !643)
!680 = !DILocation(line: 817, column: 20, scope: !678)
!681 = !DILocation(line: 817, column: 19, scope: !678)
!682 = !DILocation(line: 817, column: 23, scope: !678)
!683 = !DILocation(line: 817, column: 46, scope: !678)
!684 = !DILocation(line: 817, column: 17, scope: !678)
!685 = !DILocation(line: 817, column: 7, scope: !678)
!686 = !DILocation(line: 818, column: 3, scope: !643)
!687 = !DILocation(line: 820, column: 5, scope: !637)
!688 = !DILocation(line: 799, column: 28, scope: !633)
!689 = !DILocation(line: 799, column: 5, scope: !633)
!690 = distinct !{!690, !635, !691}
!691 = !DILocation(line: 820, column: 5, scope: !629)
!692 = !DILocation(line: 827, column: 19, scope: !693)
!693 = distinct !DILexicalBlock(scope: !603, file: !3, line: 827, column: 9)
!694 = !DILocation(line: 827, column: 22, scope: !693)
!695 = !DILocation(line: 827, column: 9, scope: !603)
!696 = !DILocation(line: 828, column: 36, scope: !697)
!697 = distinct !DILexicalBlock(scope: !698, file: !3, line: 828, column: 6)
!698 = distinct !DILexicalBlock(scope: !693, file: !3, line: 827, column: 31)
!699 = !DILocation(line: 828, column: 22, scope: !697)
!700 = !DILocation(line: 828, column: 20, scope: !697)
!701 = !DILocation(line: 828, column: 48, scope: !697)
!702 = !DILocation(line: 828, column: 6, scope: !698)
!703 = !DILocation(line: 834, column: 10, scope: !704)
!704 = distinct !DILexicalBlock(scope: !705, file: !3, line: 834, column: 10)
!705 = distinct !DILexicalBlock(scope: !697, file: !3, line: 828, column: 57)
!706 = !DILocation(line: 834, column: 20, scope: !704)
!707 = !DILocation(line: 834, column: 33, scope: !704)
!708 = !DILocation(line: 834, column: 36, scope: !704)
!709 = !DILocation(line: 834, column: 46, scope: !704)
!710 = !DILocation(line: 834, column: 10, scope: !705)
!711 = !DILocation(line: 835, column: 3, scope: !712)
!712 = distinct !DILexicalBlock(scope: !704, file: !3, line: 834, column: 66)
!713 = !DILocation(line: 835, column: 3, scope: !714)
!714 = distinct !DILexicalBlock(scope: !712, file: !3, line: 835, column: 3)
!715 = !DILocation(line: 836, column: 3, scope: !712)
!716 = !DILocalVariable(name: "sudo_debug_ret", scope: !717, file: !3, line: 836, type: !213)
!717 = distinct !DILexicalBlock(scope: !712, file: !3, line: 836, column: 3)
!718 = !DILocation(line: 836, column: 3, scope: !717)
!719 = !DILocation(line: 837, column: 6, scope: !712)
!720 = !DILocation(line: 840, column: 34, scope: !705)
!721 = !DILocation(line: 840, column: 45, scope: !705)
!722 = !DILocation(line: 840, column: 55, scope: !705)
!723 = !DILocation(line: 840, column: 21, scope: !705)
!724 = !DILocation(line: 840, column: 19, scope: !705)
!725 = !DILocation(line: 841, column: 19, scope: !705)
!726 = !DILocation(line: 842, column: 2, scope: !705)
!727 = !DILocation(line: 843, column: 5, scope: !698)
!728 = !DILocation(line: 844, column: 9, scope: !729)
!729 = distinct !DILexicalBlock(scope: !603, file: !3, line: 844, column: 9)
!730 = !DILocation(line: 844, column: 23, scope: !729)
!731 = !DILocation(line: 844, column: 9, scope: !603)
!732 = !DILocation(line: 845, column: 45, scope: !729)
!733 = !DILocation(line: 845, column: 18, scope: !729)
!734 = !DILocation(line: 845, column: 16, scope: !729)
!735 = !DILocation(line: 845, column: 2, scope: !729)
!736 = !DILocation(line: 848, column: 10, scope: !737)
!737 = distinct !DILexicalBlock(scope: !603, file: !3, line: 848, column: 9)
!738 = !DILocation(line: 848, column: 9, scope: !603)
!739 = !DILocation(line: 849, column: 2, scope: !737)
!740 = !DILocalVariable(name: "sudo_debug_ret", scope: !741, file: !3, line: 849, type: !213)
!741 = distinct !DILexicalBlock(scope: !737, file: !3, line: 849, column: 2)
!742 = !DILocation(line: 849, column: 2, scope: !741)
!743 = !DILocation(line: 852, column: 5, scope: !603)
!744 = !DILocation(line: 855, column: 9, scope: !745)
!745 = distinct !DILexicalBlock(scope: !603, file: !3, line: 855, column: 9)
!746 = !DILocation(line: 855, column: 9, scope: !603)
!747 = !DILocation(line: 857, column: 21, scope: !748)
!748 = distinct !DILexicalBlock(scope: !745, file: !3, line: 855, column: 23)
!749 = !DILocation(line: 856, column: 2, scope: !748)
!750 = !DILocation(line: 858, column: 2, scope: !748)
!751 = !DILocalVariable(name: "sudo_debug_ret", scope: !752, file: !3, line: 858, type: !213)
!752 = distinct !DILexicalBlock(scope: !748, file: !3, line: 858, column: 2)
!753 = !DILocation(line: 858, column: 2, scope: !752)
!754 = !DILocation(line: 859, column: 5, scope: !748)
!755 = !DILocation(line: 866, column: 19, scope: !756)
!756 = distinct !DILexicalBlock(scope: !603, file: !3, line: 866, column: 9)
!757 = !DILocation(line: 866, column: 31, scope: !756)
!758 = !DILocation(line: 866, column: 9, scope: !603)
!759 = !DILocation(line: 867, column: 29, scope: !760)
!760 = distinct !DILexicalBlock(scope: !761, file: !3, line: 867, column: 6)
!761 = distinct !DILexicalBlock(scope: !756, file: !3, line: 866, column: 40)
!762 = !DILocation(line: 867, column: 7, scope: !760)
!763 = !DILocation(line: 867, column: 6, scope: !761)
!764 = !DILocation(line: 868, column: 6, scope: !760)
!765 = !DILocalVariable(name: "sudo_debug_ret", scope: !766, file: !3, line: 868, type: !213)
!766 = distinct !DILexicalBlock(scope: !760, file: !3, line: 868, column: 6)
!767 = !DILocation(line: 868, column: 6, scope: !766)
!768 = !DILocation(line: 869, column: 29, scope: !769)
!769 = distinct !DILexicalBlock(scope: !761, file: !3, line: 869, column: 6)
!770 = !DILocation(line: 869, column: 19, scope: !769)
!771 = !DILocation(line: 870, column: 13, scope: !769)
!772 = !DILocation(line: 870, column: 26, scope: !769)
!773 = !DILocation(line: 869, column: 7, scope: !769)
!774 = !DILocation(line: 869, column: 6, scope: !761)
!775 = !DILocation(line: 871, column: 6, scope: !769)
!776 = !DILocalVariable(name: "sudo_debug_ret", scope: !777, file: !3, line: 871, type: !213)
!777 = distinct !DILexicalBlock(scope: !769, file: !3, line: 871, column: 6)
!778 = !DILocation(line: 871, column: 6, scope: !777)
!779 = !DILocation(line: 872, column: 5, scope: !761)
!780 = !DILocation(line: 873, column: 29, scope: !781)
!781 = distinct !DILexicalBlock(scope: !782, file: !3, line: 873, column: 6)
!782 = distinct !DILexicalBlock(scope: !756, file: !3, line: 872, column: 12)
!783 = !DILocation(line: 873, column: 19, scope: !781)
!784 = !DILocation(line: 874, column: 13, scope: !781)
!785 = !DILocation(line: 874, column: 26, scope: !781)
!786 = !DILocation(line: 873, column: 7, scope: !781)
!787 = !DILocation(line: 873, column: 6, scope: !782)
!788 = !DILocation(line: 875, column: 6, scope: !781)
!789 = !DILocalVariable(name: "sudo_debug_ret", scope: !790, file: !3, line: 875, type: !213)
!790 = distinct !DILexicalBlock(scope: !781, file: !3, line: 875, column: 6)
!791 = !DILocation(line: 875, column: 6, scope: !790)
!792 = !DILocation(line: 878, column: 5, scope: !603)
!793 = !DILocalVariable(name: "sudo_debug_ret", scope: !794, file: !3, line: 878, type: !213)
!794 = distinct !DILexicalBlock(scope: !603, file: !3, line: 878, column: 5)
!795 = !DILocation(line: 878, column: 5, scope: !794)
!796 = !DILocation(line: 879, column: 1, scope: !603)
!797 = distinct !DISubprogram(name: "set_loginclass", scope: !3, file: !3, line: 1161, type: !798, scopeLine: 1162, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !12, retainedNodes: !405)
!798 = !DISubroutineType(types: !799)
!799 = !{!213, !102}
!800 = !DILocalVariable(name: "pw", arg: 1, scope: !797, file: !3, line: 1161, type: !102)
!801 = !DILocation(line: 1161, column: 31, scope: !797)
!802 = !DILocation(line: 1163, column: 5, scope: !797)
!803 = distinct !DISubprogram(name: "sudoers_policy_main", scope: !3, file: !3, line: 332, type: !804, scopeLine: 334, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !12, retainedNodes: !405)
!804 = !DISubroutineType(types: !805)
!805 = !{!6, !6, !8, !6, !125, !213, !7}
!806 = !DILocalVariable(name: "argc", arg: 1, scope: !803, file: !3, line: 332, type: !6)
!807 = !DILocation(line: 332, column: 25, scope: !803)
!808 = !DILocalVariable(name: "argv", arg: 2, scope: !803, file: !3, line: 332, type: !8)
!809 = !DILocation(line: 332, column: 44, scope: !803)
!810 = !DILocalVariable(name: "pwflag", arg: 3, scope: !803, file: !3, line: 332, type: !6)
!811 = !DILocation(line: 332, column: 56, scope: !803)
!812 = !DILocalVariable(name: "env_add", arg: 4, scope: !803, file: !3, line: 332, type: !125)
!813 = !DILocation(line: 332, column: 70, scope: !803)
!814 = !DILocalVariable(name: "verbose", arg: 5, scope: !803, file: !3, line: 333, type: !213)
!815 = !DILocation(line: 333, column: 10, scope: !803)
!816 = !DILocalVariable(name: "closure", arg: 6, scope: !803, file: !3, line: 333, type: !7)
!817 = !DILocation(line: 333, column: 25, scope: !803)
!818 = !DILocalVariable(name: "iolog_path", scope: !803, file: !3, line: 335, type: !10)
!819 = !DILocation(line: 335, column: 11, scope: !803)
!820 = !DILocalVariable(name: "cmnd_umask", scope: !803, file: !3, line: 336, type: !198)
!821 = !DILocation(line: 336, column: 12, scope: !803)
!822 = !DILocalVariable(name: "nss", scope: !803, file: !3, line: 337, type: !225)
!823 = !DILocation(line: 337, column: 22, scope: !803)
!824 = !DILocalVariable(name: "oldlocale", scope: !803, file: !3, line: 338, type: !6)
!825 = !DILocation(line: 338, column: 9, scope: !803)
!826 = !DILocalVariable(name: "validated", scope: !803, file: !3, line: 338, type: !6)
!827 = !DILocation(line: 338, column: 20, scope: !803)
!828 = !DILocalVariable(name: "ret", scope: !803, file: !3, line: 338, type: !6)
!829 = !DILocation(line: 338, column: 31, scope: !803)
!830 = !DILocalVariable(name: "sudo_debug_subsys", scope: !803, file: !3, line: 339, type: !425)
!831 = !DILocation(line: 339, column: 5, scope: !803)
!832 = !DILocation(line: 341, column: 5, scope: !803)
!833 = !DILocation(line: 343, column: 5, scope: !803)
!834 = !DILocation(line: 346, column: 9, scope: !835)
!835 = distinct !DILexicalBlock(scope: !803, file: !3, line: 346, column: 9)
!836 = !DILocation(line: 346, column: 18, scope: !835)
!837 = !DILocation(line: 346, column: 23, scope: !835)
!838 = !DILocation(line: 346, column: 27, scope: !835)
!839 = !DILocation(line: 346, column: 9, scope: !803)
!840 = !DILocation(line: 348, column: 2, scope: !841)
!841 = distinct !DILexicalBlock(scope: !835, file: !3, line: 346, column: 42)
!842 = !DILocation(line: 348, column: 2, scope: !843)
!843 = distinct !DILexicalBlock(scope: !841, file: !3, line: 348, column: 2)
!844 = !DILocation(line: 350, column: 2, scope: !841)
!845 = !DILocation(line: 353, column: 10, scope: !846)
!846 = distinct !DILexicalBlock(scope: !803, file: !3, line: 353, column: 9)
!847 = !DILocation(line: 353, column: 9, scope: !803)
!848 = !DILocation(line: 354, column: 2, scope: !846)
!849 = !DILocation(line: 357, column: 9, scope: !850)
!850 = distinct !DILexicalBlock(scope: !803, file: !3, line: 357, column: 9)
!851 = !DILocation(line: 357, column: 17, scope: !850)
!852 = !DILocation(line: 357, column: 25, scope: !850)
!853 = !DILocation(line: 357, column: 28, scope: !850)
!854 = !DILocation(line: 357, column: 39, scope: !850)
!855 = !DILocation(line: 357, column: 9, scope: !803)
!856 = !DILocation(line: 358, column: 23, scope: !850)
!857 = !DILocation(line: 358, column: 21, scope: !850)
!858 = !DILocation(line: 358, column: 2, scope: !850)
!859 = !DILocation(line: 364, column: 9, scope: !860)
!860 = distinct !DILexicalBlock(scope: !803, file: !3, line: 364, column: 9)
!861 = !DILocation(line: 364, column: 14, scope: !860)
!862 = !DILocation(line: 364, column: 9, scope: !803)
!863 = !DILocation(line: 365, column: 10, scope: !864)
!864 = distinct !DILexicalBlock(scope: !860, file: !3, line: 364, column: 20)
!865 = !DILocation(line: 366, column: 31, scope: !864)
!866 = !DILocation(line: 366, column: 39, scope: !864)
!867 = !DILocation(line: 366, column: 12, scope: !864)
!868 = !DILocation(line: 366, column: 10, scope: !864)
!869 = !DILocation(line: 367, column: 6, scope: !870)
!870 = distinct !DILexicalBlock(scope: !864, file: !3, line: 367, column: 6)
!871 = !DILocation(line: 367, column: 14, scope: !870)
!872 = !DILocation(line: 367, column: 6, scope: !864)
!873 = !DILocation(line: 368, column: 6, scope: !874)
!874 = distinct !DILexicalBlock(scope: !870, file: !3, line: 367, column: 23)
!875 = !DILocation(line: 368, column: 6, scope: !876)
!876 = distinct !DILexicalBlock(scope: !874, file: !3, line: 368, column: 6)
!877 = !DILocation(line: 369, column: 6, scope: !874)
!878 = !DILocation(line: 371, column: 28, scope: !864)
!879 = !DILocation(line: 371, column: 2, scope: !864)
!880 = !DILocation(line: 372, column: 15, scope: !864)
!881 = !DILocation(line: 372, column: 2, scope: !864)
!882 = !DILocation(line: 372, column: 13, scope: !864)
!883 = !DILocation(line: 373, column: 2, scope: !864)
!884 = !DILocation(line: 373, column: 13, scope: !864)
!885 = !DILocation(line: 374, column: 5, scope: !864)
!886 = !DILocation(line: 376, column: 12, scope: !887)
!887 = distinct !DILexicalBlock(scope: !860, file: !3, line: 374, column: 12)
!888 = !DILocation(line: 376, column: 10, scope: !887)
!889 = !DILocation(line: 377, column: 31, scope: !887)
!890 = !DILocation(line: 377, column: 39, scope: !887)
!891 = !DILocation(line: 377, column: 12, scope: !887)
!892 = !DILocation(line: 377, column: 10, scope: !887)
!893 = !DILocation(line: 378, column: 6, scope: !894)
!894 = distinct !DILexicalBlock(scope: !887, file: !3, line: 378, column: 6)
!895 = !DILocation(line: 378, column: 14, scope: !894)
!896 = !DILocation(line: 378, column: 6, scope: !887)
!897 = !DILocation(line: 379, column: 6, scope: !898)
!898 = distinct !DILexicalBlock(scope: !894, file: !3, line: 378, column: 23)
!899 = !DILocation(line: 379, column: 6, scope: !900)
!900 = distinct !DILexicalBlock(scope: !898, file: !3, line: 379, column: 6)
!901 = !DILocation(line: 380, column: 6, scope: !898)
!902 = !DILocation(line: 382, column: 28, scope: !887)
!903 = !DILocation(line: 382, column: 2, scope: !887)
!904 = !DILocation(line: 383, column: 9, scope: !887)
!905 = !DILocation(line: 384, column: 9, scope: !887)
!906 = !DILocation(line: 384, column: 2, scope: !887)
!907 = !DILocation(line: 384, column: 18, scope: !887)
!908 = !DILocation(line: 384, column: 24, scope: !887)
!909 = !DILocation(line: 384, column: 29, scope: !887)
!910 = !DILocation(line: 385, column: 2, scope: !887)
!911 = !DILocation(line: 385, column: 10, scope: !887)
!912 = !DILocation(line: 385, column: 19, scope: !887)
!913 = !DILocation(line: 386, column: 6, scope: !914)
!914 = distinct !DILexicalBlock(scope: !887, file: !3, line: 386, column: 6)
!915 = !DILocation(line: 386, column: 41, scope: !914)
!916 = !DILocation(line: 386, column: 44, scope: !914)
!917 = !DILocation(line: 386, column: 53, scope: !914)
!918 = !DILocation(line: 386, column: 6, scope: !887)
!919 = !DILocation(line: 387, column: 26, scope: !920)
!920 = distinct !DILexicalBlock(scope: !914, file: !3, line: 386, column: 62)
!921 = !DILocation(line: 387, column: 36, scope: !920)
!922 = !DILocation(line: 387, column: 19, scope: !920)
!923 = !DILocation(line: 387, column: 6, scope: !920)
!924 = !DILocation(line: 387, column: 17, scope: !920)
!925 = !DILocation(line: 388, column: 10, scope: !926)
!926 = distinct !DILexicalBlock(scope: !920, file: !3, line: 388, column: 10)
!927 = !DILocation(line: 388, column: 21, scope: !926)
!928 = !DILocation(line: 388, column: 10, scope: !920)
!929 = !DILocation(line: 389, column: 3, scope: !930)
!930 = distinct !DILexicalBlock(scope: !926, file: !3, line: 388, column: 30)
!931 = !DILocation(line: 389, column: 3, scope: !932)
!932 = distinct !DILexicalBlock(scope: !930, file: !3, line: 389, column: 3)
!933 = !DILocation(line: 390, column: 3, scope: !930)
!934 = !DILocation(line: 392, column: 29, scope: !920)
!935 = !DILocation(line: 392, column: 6, scope: !920)
!936 = !DILocation(line: 393, column: 2, scope: !920)
!937 = !DILocation(line: 397, column: 9, scope: !938)
!938 = distinct !DILexicalBlock(scope: !803, file: !3, line: 397, column: 9)
!939 = !DILocation(line: 397, column: 9, scope: !803)
!940 = !DILocation(line: 398, column: 22, scope: !938)
!941 = !DILocation(line: 398, column: 2, scope: !938)
!942 = !DILocation(line: 401, column: 19, scope: !803)
!943 = !DILocation(line: 401, column: 17, scope: !803)
!944 = !DILocation(line: 402, column: 9, scope: !945)
!945 = distinct !DILexicalBlock(scope: !803, file: !3, line: 402, column: 9)
!946 = !DILocation(line: 402, column: 21, scope: !945)
!947 = !DILocation(line: 402, column: 9, scope: !803)
!948 = !DILocation(line: 403, column: 2, scope: !945)
!949 = !DILocation(line: 406, column: 9, scope: !950)
!950 = distinct !DILexicalBlock(scope: !803, file: !3, line: 406, column: 9)
!951 = !DILocation(line: 406, column: 24, scope: !950)
!952 = !DILocation(line: 406, column: 29, scope: !950)
!953 = !DILocation(line: 406, column: 32, scope: !950)
!954 = !DILocation(line: 406, column: 50, scope: !950)
!955 = !DILocation(line: 406, column: 47, scope: !950)
!956 = !DILocation(line: 406, column: 9, scope: !803)
!957 = !DILocation(line: 407, column: 7, scope: !958)
!958 = distinct !DILexicalBlock(scope: !959, file: !3, line: 407, column: 6)
!959 = distinct !DILexicalBlock(scope: !950, file: !3, line: 406, column: 65)
!960 = !DILocation(line: 407, column: 6, scope: !959)
!961 = !DILocation(line: 408, column: 6, scope: !962)
!962 = distinct !DILexicalBlock(scope: !958, file: !3, line: 407, column: 31)
!963 = !DILocation(line: 410, column: 6, scope: !962)
!964 = !DILocation(line: 410, column: 6, scope: !965)
!965 = distinct !DILexicalBlock(scope: !962, file: !3, line: 410, column: 6)
!966 = !DILocation(line: 411, column: 6, scope: !962)
!967 = !DILocation(line: 413, column: 18, scope: !959)
!968 = !DILocation(line: 413, column: 16, scope: !959)
!969 = !DILocation(line: 414, column: 5, scope: !959)
!970 = !DILocation(line: 419, column: 5, scope: !803)
!971 = !DILocation(line: 420, column: 32, scope: !803)
!972 = !DILocation(line: 420, column: 47, scope: !803)
!973 = !DILocation(line: 420, column: 65, scope: !803)
!974 = !DILocation(line: 420, column: 17, scope: !803)
!975 = !DILocation(line: 420, column: 15, scope: !803)
!976 = !DILocation(line: 421, column: 9, scope: !977)
!977 = distinct !DILexicalBlock(scope: !803, file: !3, line: 421, column: 9)
!978 = !DILocation(line: 421, column: 9, scope: !803)
!979 = !DILocation(line: 423, column: 2, scope: !980)
!980 = distinct !DILexicalBlock(scope: !977, file: !3, line: 421, column: 43)
!981 = !DILocation(line: 427, column: 23, scope: !803)
!982 = !DILocation(line: 427, column: 5, scope: !803)
!983 = !DILocation(line: 429, column: 9, scope: !984)
!984 = distinct !DILexicalBlock(scope: !803, file: !3, line: 429, column: 9)
!985 = !DILocation(line: 429, column: 19, scope: !984)
!986 = !DILocation(line: 429, column: 9, scope: !803)
!987 = !DILocation(line: 430, column: 26, scope: !988)
!988 = distinct !DILexicalBlock(scope: !989, file: !3, line: 430, column: 6)
!989 = distinct !DILexicalBlock(scope: !984, file: !3, line: 429, column: 28)
!990 = !DILocation(line: 430, column: 19, scope: !988)
!991 = !DILocation(line: 430, column: 17, scope: !988)
!992 = !DILocation(line: 430, column: 38, scope: !988)
!993 = !DILocation(line: 430, column: 6, scope: !989)
!994 = !DILocation(line: 431, column: 6, scope: !995)
!995 = distinct !DILexicalBlock(scope: !988, file: !3, line: 430, column: 47)
!996 = !DILocation(line: 431, column: 6, scope: !997)
!997 = distinct !DILexicalBlock(scope: !995, file: !3, line: 431, column: 6)
!998 = !DILocation(line: 432, column: 6, scope: !995)
!999 = !DILocation(line: 434, column: 5, scope: !989)
!1000 = !DILocation(line: 437, column: 9, scope: !1001)
!1001 = distinct !DILexicalBlock(scope: !803, file: !3, line: 437, column: 9)
!1002 = !DILocation(line: 437, column: 27, scope: !1001)
!1003 = !DILocation(line: 437, column: 31, scope: !1001)
!1004 = !DILocation(line: 437, column: 9, scope: !803)
!1005 = !DILocation(line: 438, column: 51, scope: !1006)
!1006 = distinct !DILexicalBlock(scope: !1001, file: !3, line: 437, column: 59)
!1007 = !DILocation(line: 438, column: 61, scope: !1006)
!1008 = !DILocation(line: 438, column: 2, scope: !1006)
!1009 = !DILocation(line: 439, column: 2, scope: !1006)
!1010 = !DILocation(line: 441, column: 9, scope: !1011)
!1011 = distinct !DILexicalBlock(scope: !803, file: !3, line: 441, column: 9)
!1012 = !DILocation(line: 441, column: 18, scope: !1011)
!1013 = !DILocation(line: 441, column: 9, scope: !803)
!1014 = !DILocation(line: 442, column: 6, scope: !1015)
!1015 = distinct !DILexicalBlock(scope: !1016, file: !3, line: 442, column: 6)
!1016 = distinct !DILexicalBlock(scope: !1011, file: !3, line: 441, column: 27)
!1017 = !DILocation(line: 442, column: 24, scope: !1015)
!1018 = !DILocation(line: 442, column: 28, scope: !1015)
!1019 = !DILocation(line: 442, column: 6, scope: !1016)
!1020 = !DILocation(line: 444, column: 3, scope: !1021)
!1021 = distinct !DILexicalBlock(scope: !1015, file: !3, line: 442, column: 56)
!1022 = !DILocation(line: 444, column: 13, scope: !1021)
!1023 = !DILocation(line: 443, column: 6, scope: !1021)
!1024 = !DILocation(line: 445, column: 6, scope: !1021)
!1025 = !DILocation(line: 447, column: 5, scope: !1016)
!1026 = !DILocation(line: 452, column: 9, scope: !1027)
!1027 = distinct !DILexicalBlock(scope: !803, file: !3, line: 452, column: 9)
!1028 = !DILocation(line: 452, column: 9, scope: !803)
!1029 = !DILocalVariable(name: "pw", scope: !1030, file: !3, line: 453, type: !102)
!1030 = distinct !DILexicalBlock(scope: !1027, file: !3, line: 452, column: 29)
!1031 = !DILocation(line: 453, column: 17, scope: !1030)
!1032 = !DILocation(line: 455, column: 7, scope: !1033)
!1033 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 455, column: 6)
!1034 = !DILocation(line: 455, column: 6, scope: !1033)
!1035 = !DILocation(line: 455, column: 26, scope: !1033)
!1036 = !DILocation(line: 455, column: 6, scope: !1030)
!1037 = !DILocalVariable(name: "errstr", scope: !1038, file: !3, line: 456, type: !375)
!1038 = distinct !DILexicalBlock(scope: !1033, file: !3, line: 455, column: 34)
!1039 = !DILocation(line: 456, column: 18, scope: !1038)
!1040 = !DILocalVariable(name: "uid", scope: !1038, file: !3, line: 457, type: !200)
!1041 = !DILocation(line: 457, column: 12, scope: !1038)
!1042 = !DILocation(line: 457, column: 18, scope: !1038)
!1043 = !DILocation(line: 458, column: 10, scope: !1044)
!1044 = distinct !DILexicalBlock(scope: !1038, file: !3, line: 458, column: 10)
!1045 = !DILocation(line: 458, column: 17, scope: !1044)
!1046 = !DILocation(line: 458, column: 10, scope: !1038)
!1047 = !DILocation(line: 459, column: 22, scope: !1044)
!1048 = !DILocation(line: 459, column: 8, scope: !1044)
!1049 = !DILocation(line: 459, column: 6, scope: !1044)
!1050 = !DILocation(line: 459, column: 3, scope: !1044)
!1051 = !DILocation(line: 460, column: 2, scope: !1038)
!1052 = !DILocation(line: 461, column: 6, scope: !1053)
!1053 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 461, column: 6)
!1054 = !DILocation(line: 461, column: 9, scope: !1053)
!1055 = !DILocation(line: 461, column: 6, scope: !1030)
!1056 = !DILocation(line: 462, column: 25, scope: !1053)
!1057 = !DILocation(line: 462, column: 11, scope: !1053)
!1058 = !DILocation(line: 462, column: 9, scope: !1053)
!1059 = !DILocation(line: 462, column: 6, scope: !1053)
!1060 = !DILocation(line: 463, column: 6, scope: !1061)
!1061 = distinct !DILexicalBlock(scope: !1030, file: !3, line: 463, column: 6)
!1062 = !DILocation(line: 463, column: 9, scope: !1061)
!1063 = !DILocation(line: 463, column: 6, scope: !1030)
!1064 = !DILocation(line: 464, column: 22, scope: !1065)
!1065 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 463, column: 18)
!1066 = !DILocation(line: 464, column: 26, scope: !1065)
!1067 = !DILocation(line: 464, column: 20, scope: !1065)
!1068 = !DILocation(line: 465, column: 22, scope: !1065)
!1069 = !DILocation(line: 465, column: 26, scope: !1065)
!1070 = !DILocation(line: 465, column: 20, scope: !1065)
!1071 = !DILocation(line: 466, column: 21, scope: !1065)
!1072 = !DILocation(line: 466, column: 6, scope: !1065)
!1073 = !DILocation(line: 467, column: 2, scope: !1065)
!1074 = !DILocation(line: 470, column: 45, scope: !1075)
!1075 = distinct !DILexicalBlock(scope: !1061, file: !3, line: 467, column: 9)
!1076 = !DILocation(line: 469, column: 6, scope: !1075)
!1077 = !DILocation(line: 471, column: 20, scope: !1075)
!1078 = !DILocation(line: 472, column: 20, scope: !1075)
!1079 = !DILocation(line: 474, column: 5, scope: !1030)
!1080 = !DILocation(line: 477, column: 9, scope: !1081)
!1081 = distinct !DILexicalBlock(scope: !803, file: !3, line: 477, column: 9)
!1082 = !DILocation(line: 477, column: 46, scope: !1081)
!1083 = !DILocation(line: 477, column: 50, scope: !1081)
!1084 = !DILocation(line: 477, column: 9, scope: !803)
!1085 = !DILocation(line: 479, column: 6, scope: !1086)
!1086 = distinct !DILexicalBlock(scope: !1081, file: !3, line: 477, column: 68)
!1087 = !DILocation(line: 480, column: 2, scope: !1086)
!1088 = !DILocation(line: 484, column: 9, scope: !1089)
!1089 = distinct !DILexicalBlock(scope: !803, file: !3, line: 484, column: 9)
!1090 = !DILocation(line: 484, column: 24, scope: !1089)
!1091 = !DILocation(line: 484, column: 28, scope: !1089)
!1092 = !DILocation(line: 484, column: 9, scope: !803)
!1093 = !DILocation(line: 485, column: 2, scope: !1094)
!1094 = distinct !DILexicalBlock(scope: !1089, file: !3, line: 484, column: 43)
!1095 = !DILocation(line: 486, column: 2, scope: !1094)
!1096 = !DILocation(line: 486, column: 2, scope: !1097)
!1097 = distinct !DILexicalBlock(scope: !1094, file: !3, line: 486, column: 2)
!1098 = !DILocation(line: 487, column: 2, scope: !1094)
!1099 = !DILocation(line: 491, column: 27, scope: !1100)
!1100 = distinct !DILexicalBlock(scope: !803, file: !3, line: 491, column: 9)
!1101 = !DILocation(line: 491, column: 10, scope: !1100)
!1102 = !DILocation(line: 491, column: 9, scope: !803)
!1103 = !DILocation(line: 494, column: 6, scope: !1104)
!1104 = distinct !DILexicalBlock(scope: !1100, file: !3, line: 491, column: 38)
!1105 = !DILocation(line: 494, column: 16, scope: !1104)
!1106 = !DILocation(line: 494, column: 25, scope: !1104)
!1107 = !DILocation(line: 494, column: 35, scope: !1104)
!1108 = !DILocation(line: 492, column: 2, scope: !1104)
!1109 = !DILocation(line: 495, column: 2, scope: !1104)
!1110 = !DILocation(line: 502, column: 9, scope: !1111)
!1111 = distinct !DILexicalBlock(scope: !803, file: !3, line: 502, column: 9)
!1112 = !DILocation(line: 502, column: 37, scope: !1111)
!1113 = !DILocation(line: 503, column: 3, scope: !1111)
!1114 = !DILocation(line: 503, column: 39, scope: !1111)
!1115 = !DILocation(line: 503, column: 42, scope: !1111)
!1116 = !DILocation(line: 502, column: 9, scope: !803)
!1117 = !DILocation(line: 504, column: 16, scope: !1111)
!1118 = !DILocation(line: 504, column: 2, scope: !1111)
!1119 = !DILocation(line: 507, column: 10, scope: !1120)
!1120 = distinct !DILexicalBlock(scope: !803, file: !3, line: 507, column: 9)
!1121 = !DILocation(line: 507, column: 9, scope: !803)
!1122 = !DILocation(line: 508, column: 2, scope: !1120)
!1123 = !DILocation(line: 511, column: 24, scope: !803)
!1124 = !DILocation(line: 511, column: 35, scope: !803)
!1125 = !DILocation(line: 511, column: 13, scope: !803)
!1126 = !DILocation(line: 511, column: 5, scope: !803)
!1127 = !DILocation(line: 514, column: 2, scope: !1128)
!1128 = distinct !DILexicalBlock(scope: !803, file: !3, line: 511, column: 47)
!1129 = !DILocation(line: 517, column: 7, scope: !1130)
!1130 = distinct !DILexicalBlock(scope: !1128, file: !3, line: 517, column: 6)
!1131 = !DILocation(line: 517, column: 6, scope: !1128)
!1132 = !DILocation(line: 519, column: 22, scope: !1133)
!1133 = distinct !DILexicalBlock(scope: !1134, file: !3, line: 519, column: 10)
!1134 = distinct !DILexicalBlock(scope: !1130, file: !3, line: 517, column: 43)
!1135 = !DILocation(line: 519, column: 33, scope: !1133)
!1136 = !DILocation(line: 519, column: 50, scope: !1133)
!1137 = !DILocation(line: 519, column: 11, scope: !1133)
!1138 = !DILocation(line: 519, column: 10, scope: !1134)
!1139 = !DILocation(line: 520, column: 3, scope: !1133)
!1140 = !DILocation(line: 521, column: 2, scope: !1134)
!1141 = !DILocation(line: 522, column: 2, scope: !1128)
!1142 = !DILocation(line: 525, column: 2, scope: !1128)
!1143 = !DILocation(line: 529, column: 13, scope: !803)
!1144 = !DILocation(line: 529, column: 5, scope: !803)
!1145 = !DILocation(line: 531, column: 2, scope: !1146)
!1146 = distinct !DILexicalBlock(scope: !803, file: !3, line: 529, column: 37)
!1147 = !DILocation(line: 533, column: 2, scope: !1146)
!1148 = !DILocation(line: 535, column: 2, scope: !1146)
!1149 = !DILocation(line: 539, column: 13, scope: !803)
!1150 = !DILocation(line: 539, column: 5, scope: !803)
!1151 = !DILocation(line: 541, column: 2, scope: !1152)
!1152 = distinct !DILexicalBlock(scope: !803, file: !3, line: 539, column: 34)
!1153 = !DILocation(line: 543, column: 2, scope: !1152)
!1154 = !DILocation(line: 545, column: 2, scope: !1152)
!1155 = !DILocation(line: 550, column: 9, scope: !1156)
!1156 = distinct !DILexicalBlock(scope: !803, file: !3, line: 550, column: 9)
!1157 = !DILocation(line: 550, column: 19, scope: !1156)
!1158 = !DILocation(line: 550, column: 44, scope: !1156)
!1159 = !DILocation(line: 550, column: 47, scope: !1156)
!1160 = !DILocation(line: 550, column: 57, scope: !1156)
!1161 = !DILocation(line: 550, column: 9, scope: !803)
!1162 = !DILocation(line: 551, column: 6, scope: !1163)
!1163 = distinct !DILexicalBlock(scope: !1164, file: !3, line: 551, column: 6)
!1164 = distinct !DILexicalBlock(scope: !1156, file: !3, line: 550, column: 66)
!1165 = !DILocation(line: 551, column: 15, scope: !1163)
!1166 = !DILocation(line: 551, column: 20, scope: !1163)
!1167 = !DILocation(line: 551, column: 30, scope: !1163)
!1168 = !DILocation(line: 551, column: 23, scope: !1163)
!1169 = !DILocation(line: 551, column: 49, scope: !1163)
!1170 = !DILocation(line: 551, column: 6, scope: !1164)
!1171 = !DILocalVariable(name: "pw", scope: !1172, file: !3, line: 552, type: !102)
!1172 = distinct !DILexicalBlock(scope: !1163, file: !3, line: 551, column: 55)
!1173 = !DILocation(line: 552, column: 21, scope: !1172)
!1174 = !DILocation(line: 554, column: 30, scope: !1175)
!1175 = distinct !DILexicalBlock(scope: !1172, file: !3, line: 554, column: 10)
!1176 = !DILocation(line: 554, column: 16, scope: !1175)
!1177 = !DILocation(line: 554, column: 14, scope: !1175)
!1178 = !DILocation(line: 554, column: 42, scope: !1175)
!1179 = !DILocation(line: 554, column: 10, scope: !1172)
!1180 = !DILocation(line: 555, column: 21, scope: !1181)
!1181 = distinct !DILexicalBlock(scope: !1182, file: !3, line: 555, column: 11)
!1182 = distinct !DILexicalBlock(scope: !1175, file: !3, line: 554, column: 51)
!1183 = !DILocation(line: 555, column: 24, scope: !1181)
!1184 = !DILocation(line: 555, column: 11, scope: !1182)
!1185 = !DILocation(line: 556, column: 29, scope: !1181)
!1186 = !DILocation(line: 556, column: 4, scope: !1181)
!1187 = !DILocation(line: 557, column: 22, scope: !1182)
!1188 = !DILocation(line: 557, column: 20, scope: !1182)
!1189 = !DILocation(line: 558, column: 6, scope: !1182)
!1190 = !DILocation(line: 559, column: 2, scope: !1172)
!1191 = !DILocation(line: 560, column: 5, scope: !1164)
!1192 = !DILocation(line: 563, column: 10, scope: !1193)
!1193 = distinct !DILexicalBlock(scope: !803, file: !3, line: 563, column: 9)
!1194 = !DILocation(line: 563, column: 9, scope: !803)
!1195 = !DILocation(line: 565, column: 19, scope: !1196)
!1196 = distinct !DILexicalBlock(scope: !1197, file: !3, line: 565, column: 6)
!1197 = distinct !DILexicalBlock(scope: !1193, file: !3, line: 563, column: 46)
!1198 = !DILocation(line: 565, column: 30, scope: !1196)
!1199 = !DILocation(line: 565, column: 7, scope: !1196)
!1200 = !DILocation(line: 565, column: 6, scope: !1197)
!1201 = !DILocation(line: 566, column: 6, scope: !1196)
!1202 = !DILocation(line: 567, column: 2, scope: !1197)
!1203 = !DILocation(line: 571, column: 9, scope: !1204)
!1204 = distinct !DILexicalBlock(scope: !803, file: !3, line: 571, column: 9)
!1205 = !DILocation(line: 571, column: 37, scope: !1204)
!1206 = !DILocation(line: 571, column: 9, scope: !803)
!1207 = !DILocation(line: 572, column: 2, scope: !1204)
!1208 = !DILocation(line: 575, column: 9, scope: !1209)
!1209 = distinct !DILexicalBlock(scope: !803, file: !3, line: 575, column: 9)
!1210 = !DILocation(line: 575, column: 21, scope: !1209)
!1211 = !DILocation(line: 575, column: 9, scope: !803)
!1212 = !DILocation(line: 576, column: 16, scope: !1213)
!1213 = distinct !DILexicalBlock(scope: !1209, file: !3, line: 575, column: 39)
!1214 = !DILocation(line: 576, column: 2, scope: !1213)
!1215 = !DILocation(line: 577, column: 2, scope: !1213)
!1216 = !DILocation(line: 577, column: 2, scope: !1217)
!1217 = distinct !DILexicalBlock(scope: !1213, file: !3, line: 577, column: 2)
!1218 = !DILocation(line: 578, column: 2, scope: !1213)
!1219 = !DILocation(line: 579, column: 16, scope: !1220)
!1220 = distinct !DILexicalBlock(scope: !1209, file: !3, line: 579, column: 16)
!1221 = !DILocation(line: 579, column: 28, scope: !1220)
!1222 = !DILocation(line: 579, column: 16, scope: !1209)
!1223 = !DILocation(line: 580, column: 6, scope: !1224)
!1224 = distinct !DILexicalBlock(scope: !1225, file: !3, line: 580, column: 6)
!1225 = distinct !DILexicalBlock(scope: !1220, file: !3, line: 579, column: 42)
!1226 = !DILocation(line: 580, column: 6, scope: !1225)
!1227 = !DILocation(line: 581, column: 20, scope: !1228)
!1228 = distinct !DILexicalBlock(scope: !1224, file: !3, line: 580, column: 36)
!1229 = !DILocation(line: 582, column: 3, scope: !1228)
!1230 = !DILocation(line: 581, column: 6, scope: !1228)
!1231 = !DILocation(line: 583, column: 6, scope: !1228)
!1232 = !DILocation(line: 583, column: 6, scope: !1233)
!1233 = distinct !DILexicalBlock(scope: !1228, file: !3, line: 583, column: 6)
!1234 = !DILocation(line: 584, column: 2, scope: !1228)
!1235 = !DILocation(line: 585, column: 20, scope: !1236)
!1236 = distinct !DILexicalBlock(scope: !1224, file: !3, line: 584, column: 9)
!1237 = !DILocation(line: 586, column: 3, scope: !1236)
!1238 = !DILocation(line: 585, column: 6, scope: !1236)
!1239 = !DILocation(line: 587, column: 6, scope: !1236)
!1240 = !DILocation(line: 587, column: 6, scope: !1241)
!1241 = distinct !DILexicalBlock(scope: !1236, file: !3, line: 587, column: 6)
!1242 = !DILocation(line: 589, column: 2, scope: !1225)
!1243 = !DILocation(line: 593, column: 10, scope: !1244)
!1244 = distinct !DILexicalBlock(scope: !803, file: !3, line: 593, column: 9)
!1245 = !DILocation(line: 593, column: 36, scope: !1244)
!1246 = !DILocation(line: 593, column: 39, scope: !1244)
!1247 = !DILocation(line: 593, column: 52, scope: !1244)
!1248 = !DILocation(line: 593, column: 9, scope: !803)
!1249 = !DILocation(line: 594, column: 2, scope: !1250)
!1250 = distinct !DILexicalBlock(scope: !1244, file: !3, line: 593, column: 57)
!1251 = !DILocation(line: 596, column: 2, scope: !1250)
!1252 = !DILocation(line: 596, column: 2, scope: !1253)
!1253 = distinct !DILexicalBlock(scope: !1250, file: !3, line: 596, column: 2)
!1254 = !DILocation(line: 598, column: 2, scope: !1250)
!1255 = !DILocation(line: 602, column: 9, scope: !1256)
!1256 = distinct !DILexicalBlock(scope: !803, file: !3, line: 602, column: 9)
!1257 = !DILocation(line: 602, column: 36, scope: !1256)
!1258 = !DILocation(line: 602, column: 40, scope: !1256)
!1259 = !DILocation(line: 602, column: 9, scope: !803)
!1260 = !DILocation(line: 603, column: 6, scope: !1261)
!1261 = distinct !DILexicalBlock(scope: !1262, file: !3, line: 603, column: 6)
!1262 = distinct !DILexicalBlock(scope: !1256, file: !3, line: 602, column: 52)
!1263 = !DILocation(line: 603, column: 6, scope: !1262)
!1264 = !DILocation(line: 604, column: 6, scope: !1265)
!1265 = distinct !DILexicalBlock(scope: !1261, file: !3, line: 603, column: 43)
!1266 = !DILocation(line: 606, column: 6, scope: !1265)
!1267 = !DILocation(line: 606, column: 6, scope: !1268)
!1268 = distinct !DILexicalBlock(scope: !1265, file: !3, line: 606, column: 6)
!1269 = !DILocation(line: 608, column: 6, scope: !1265)
!1270 = !DILocation(line: 610, column: 39, scope: !1271)
!1271 = distinct !DILexicalBlock(scope: !1272, file: !3, line: 610, column: 10)
!1272 = distinct !DILexicalBlock(scope: !1261, file: !3, line: 609, column: 9)
!1273 = !DILocation(line: 610, column: 11, scope: !1271)
!1274 = !DILocation(line: 610, column: 10, scope: !1272)
!1275 = !DILocation(line: 611, column: 3, scope: !1271)
!1276 = !DILocation(line: 613, column: 5, scope: !1262)
!1277 = !DILocation(line: 615, column: 9, scope: !1278)
!1278 = distinct !DILexicalBlock(scope: !803, file: !3, line: 615, column: 9)
!1279 = !DILocation(line: 615, column: 50, scope: !1278)
!1280 = !DILocation(line: 615, column: 54, scope: !1278)
!1281 = !DILocation(line: 615, column: 9, scope: !803)
!1282 = !DILocation(line: 616, column: 7, scope: !1283)
!1283 = distinct !DILexicalBlock(scope: !1284, file: !3, line: 616, column: 6)
!1284 = distinct !DILexicalBlock(scope: !1278, file: !3, line: 615, column: 69)
!1285 = !DILocation(line: 616, column: 21, scope: !1283)
!1286 = !DILocation(line: 616, column: 24, scope: !1283)
!1287 = !DILocation(line: 616, column: 40, scope: !1283)
!1288 = !DILocation(line: 616, column: 43, scope: !1283)
!1289 = !DILocation(line: 616, column: 58, scope: !1283)
!1290 = !DILocation(line: 616, column: 61, scope: !1283)
!1291 = !DILocation(line: 616, column: 6, scope: !1284)
!1292 = !DILocation(line: 617, column: 24, scope: !1293)
!1293 = distinct !DILexicalBlock(scope: !1294, file: !3, line: 617, column: 10)
!1294 = distinct !DILexicalBlock(scope: !1283, file: !3, line: 616, column: 76)
!1295 = !DILocation(line: 617, column: 22, scope: !1293)
!1296 = !DILocation(line: 617, column: 45, scope: !1293)
!1297 = !DILocation(line: 617, column: 10, scope: !1294)
!1298 = !DILocation(line: 618, column: 8, scope: !1299)
!1299 = distinct !DILexicalBlock(scope: !1300, file: !3, line: 618, column: 7)
!1300 = distinct !DILexicalBlock(scope: !1293, file: !3, line: 617, column: 54)
!1301 = !DILocation(line: 618, column: 7, scope: !1300)
!1302 = !DILocation(line: 619, column: 7, scope: !1299)
!1303 = !DILocation(line: 621, column: 17, scope: !1300)
!1304 = !DILocation(line: 622, column: 18, scope: !1300)
!1305 = !DILocation(line: 623, column: 6, scope: !1300)
!1306 = !DILocation(line: 624, column: 2, scope: !1294)
!1307 = !DILocation(line: 625, column: 5, scope: !1284)
!1308 = !DILocation(line: 627, column: 13, scope: !803)
!1309 = !DILocation(line: 627, column: 23, scope: !803)
!1310 = !DILocation(line: 627, column: 5, scope: !803)
!1311 = !DILocation(line: 629, column: 25, scope: !1312)
!1312 = distinct !DILexicalBlock(scope: !803, file: !3, line: 627, column: 36)
!1313 = !DILocation(line: 629, column: 30, scope: !1312)
!1314 = !DILocation(line: 629, column: 40, scope: !1312)
!1315 = !DILocation(line: 629, column: 60, scope: !1312)
!1316 = !DILocation(line: 629, column: 12, scope: !1312)
!1317 = !DILocation(line: 629, column: 10, scope: !1312)
!1318 = !DILocation(line: 630, column: 6, scope: !1312)
!1319 = !DILocation(line: 632, column: 26, scope: !1312)
!1320 = !DILocation(line: 632, column: 31, scope: !1312)
!1321 = !DILocation(line: 632, column: 41, scope: !1312)
!1322 = !DILocation(line: 632, column: 61, scope: !1312)
!1323 = !DILocation(line: 632, column: 65, scope: !1312)
!1324 = !DILocation(line: 632, column: 12, scope: !1312)
!1325 = !DILocation(line: 632, column: 10, scope: !1312)
!1326 = !DILocation(line: 633, column: 6, scope: !1312)
!1327 = !DILocation(line: 638, column: 10, scope: !1312)
!1328 = !DILocation(line: 639, column: 6, scope: !1312)
!1329 = !DILocation(line: 642, column: 6, scope: !1312)
!1330 = !DILocation(line: 642, column: 6, scope: !1331)
!1331 = distinct !DILexicalBlock(scope: !1312, file: !3, line: 642, column: 6)
!1332 = !DILocation(line: 643, column: 6, scope: !1312)
!1333 = !DILocation(line: 647, column: 5, scope: !1334)
!1334 = distinct !DILexicalBlock(scope: !803, file: !3, line: 647, column: 5)
!1335 = !DILocation(line: 647, column: 5, scope: !1336)
!1336 = distinct !DILexicalBlock(scope: !1334, file: !3, line: 647, column: 5)
!1337 = !DILocation(line: 648, column: 2, scope: !1338)
!1338 = distinct !DILexicalBlock(scope: !1336, file: !3, line: 647, column: 38)
!1339 = !DILocation(line: 648, column: 7, scope: !1338)
!1340 = !DILocation(line: 648, column: 13, scope: !1338)
!1341 = !DILocation(line: 649, column: 5, scope: !1338)
!1342 = distinct !{!1342, !1333, !1343}
!1343 = !DILocation(line: 649, column: 5, scope: !1334)
!1344 = !DILocation(line: 650, column: 9, scope: !1345)
!1345 = distinct !DILexicalBlock(scope: !803, file: !3, line: 650, column: 9)
!1346 = !DILocation(line: 650, column: 9, scope: !803)
!1347 = !DILocation(line: 651, column: 2, scope: !1345)
!1348 = !DILocation(line: 652, column: 5, scope: !803)
!1349 = !DILocation(line: 654, column: 9, scope: !1350)
!1350 = distinct !DILexicalBlock(scope: !803, file: !3, line: 654, column: 9)
!1351 = !DILocation(line: 654, column: 9, scope: !803)
!1352 = !DILocation(line: 656, column: 2, scope: !1353)
!1353 = distinct !DILexicalBlock(scope: !1350, file: !3, line: 654, column: 65)
!1354 = !DILocation(line: 664, column: 9, scope: !1355)
!1355 = distinct !DILexicalBlock(scope: !803, file: !3, line: 664, column: 9)
!1356 = !DILocation(line: 664, column: 19, scope: !1355)
!1357 = !DILocation(line: 664, column: 9, scope: !803)
!1358 = !DILocation(line: 665, column: 15, scope: !1359)
!1359 = distinct !DILexicalBlock(scope: !1355, file: !3, line: 664, column: 35)
!1360 = !DILocation(line: 665, column: 13, scope: !1359)
!1361 = !DILocation(line: 666, column: 7, scope: !1362)
!1362 = distinct !DILexicalBlock(scope: !1359, file: !3, line: 666, column: 6)
!1363 = !DILocation(line: 666, column: 6, scope: !1359)
!1364 = !DILocation(line: 667, column: 20, scope: !1362)
!1365 = !DILocation(line: 667, column: 17, scope: !1362)
!1366 = !DILocation(line: 667, column: 6, scope: !1362)
!1367 = !DILocation(line: 668, column: 5, scope: !1359)
